{
    "pages": [
        {
            "text": "A work in progress\n\nWhat I’m reading\nWhat I’m obsessing over\nClips I’ve written or edited\nMy news apps.\nWhat I’m hacking on\nNewsrooms I’ve visited\nPlaces I’ve been lately.\nBurgers I ate.\nBeers I’ve drank.\nClasses I’ve taught.\n", 
            "tags": "none", 
            "loc": "http://tommeagher.github.io/lists.html", 
            "title": "Lists"
        }, 
        {
            "text": "\nCross-posted from the Sunlight Foundation’s OpenGov Voices blog.\nA few weeks ago, Hack Jersey brought a group of journalists and developers together to wrestle with campaign finance data. We thought it would be a good opportunity for many to get their hands dirty and to start thinking about new ways of reporting and building with the data.\nIn one room of our event at the New Jersey Institute of Technology, a group of journalists went on a data expedition, learning how to explore reports from the state’s Election Law Enforcement Commission. In another, we gathered developers to try to build a campaign finance app for New Jersey using the Sunlight Foundation’s APIs in a single work session.\nWe began Hack Jersey about a year ago, starting with some conversations between journalists and developers who wanted to work together to improve news and data in the Garden State. Since then, with the support of the NJ News Commons and Knight-Mozilla OpenNews, we sponsored the first news-themed hackathon in New Jersey and several smaller training events.\nWe’ve been eager to take the excitement from the traditional hackathon competition and translate it into projects that news organizations and news consumers can actually use. We wanted our “Law, Money & Politics” hackday to entice developers to work together to solve a news problem instead of competing against one another. We were psyched to be able to use Sunlight’s APIs in that effort and to have the support of the foundation, which helped sponsor our event.\nThere was clearly an interest among developers in this approach. About 15 coders—from computer science programs at local universities, the startup community and nearby news organizations—came to work, and another four helped us plan the project in our pre-hack meetups.\nAs the group took shape, we needed to figure out what we wanted to build. We spent almost four hours over two weeks talking and thinking about ideas we solicited from local news organizations. What problem did we want our app to solve?\nWe all agreed that campaign finance is a murky, labyrinthine realm and that people in New Jersey could use all the help they could get understanding it. We love the Sunlight Foundation’s InfluenceExplorer API and the way it makes state data, cleaned and cared for by the National Institute for Money in State Politics, accessible. We could spend a whole hack day or two trying to mold our state ELEC data into a more useful format, but InfluenceExplorer and NIMSP has done a lot of that dirty work for us.\nAfter what we thought was much discussion and tinkering with the API, we zeroed in on the idea of comparing campaign donations coming from industries into state elections. What industries were backing the most winners in New Jersey? How was campaign spending by industry changing from cycle to cycle? What industries were behind some of our more notable politicians?\nHackers at Hack Jersey’s Law, Money and Politics Hack day. Photo by Tom Meagher.\nWith that much decided, our team members volunteered to take certain development roles, and we got ready for the hack day. We imagined a front page with a 30,000-foot-view that would show charts of how much industries have spent on all New Jersey campaigns available in the data, going back more than 10 years. After that, we thought our user could drill in to look at specific industries and how their spending changed from cycle to cycle. Or you could put candidates in specific races side-by-side to see what industries supported them.\nBut we quickly realized that the API, which offers access to individual campaign donations by state, only really returns requests for top industry spending across the whole nation. There was no method (yet) to let us grab the top industries in just a certain state or a specific year.\nAs the day went on, we hit a few more snags when we realized there wasn’t an easy way through the API to get all the candidates who lost elections. So we downloaded the bulk data from Influence Explorer and pulled those candidates out ourselves. With each unexpected misstep, the minutes and hours flew by. In the hopes of finishing a project, we’d shrink the scope and tighten our focus.\nWe finally decided, with a couple of hours left, that we could build a demo app that would let you pick an election cycle in New Jersey, and then browse the available races and see what industries supported each candidate. Two of our developers, who also happen to be the leads for our event sponsor Broadstreet Ads, led the final sprint. They helped pull together a Python web.py framework with Angular.js and Highcharts to power the front end. We could almost see the finish line. And then we ran out of time.\nIt’s hard to build anything in 8 hours, much less bring 15 people together to make a single, deep and useful news application. Although we fell short, we had fun and learned a lot in the process for how to do it better next time:\n\nWe could have had a better handle on the very wide range of experience and backgrounds our developers brought to the team. By taking a little more time talking about our skills, we could have focused our project more closely on an attainable goal for such a short window of coding. Time is expensive and in short supply. There is no time for indecision.\nDouble the time spent planning before the event, and then double it again. Although we did a good job of considering the overall vision and anticipating some of the quirks of the data, we needed to set very specific tasks for everyone on the team and make sure people were clear about their roles and comfortable. A large group doesn’t always lend itself easily to collaborative exploration or problem solving. People need to feel like they’re in the mix, especially if they’re giving up a Saturday for a civic hack project.\nDo more pair programming. With so many developers, we should have put everyone in pairs from the outset, so each person would have a buddy to help spot mistakes and typos that can eat up precious time. We also could have designated experienced developers as leaders for each aspect (back end, front end, design, documentation), who could have helped make some of the design and implementation decisions more quickly.\nRead the documentation. Test the methods. It seems so simple, but although we spent a few hours with the Influence Explorer documentation, we still kept finding unexpected nuances in the data it returned, very late in the day. If we had spent more time with it, we could have spotted potential detours more quickly.\n\nThis was an experiment for us. Some experiments don’t work, but you can learn a lot from failure. Nearly everyone who participated said they want to work on more news hacking initiatives in the future. Several have said they plan to dig deeper into campaign finance and Sunlight’s APIs.\nAre you interested in our idea? Take a look at the repo, fork it and hack away. We’d love to get others involved, whether you’re from New Jersey or elsewhere.\nAlthough we didn’t get as far as we would have liked, it was a good experience for us at Hack Jersey. We got 15 developers thinking about campaign finance and starting to learn the ins, the outs and the possibilities.\nWe couldn’t grow an orchard in a day, but we planted a lot of good seeds. And that’s a pretty good place to start.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2013/10/hack-jersey-chases-the-8-hour-app.html", 
            "title": "Hack Jersey chases the 8 hour&nbsp;app"
        }, 
        {
            "text": "Today, I had a chance to speak at the Society of Professional\nJournalists’ Region 1 Spring conference, held at Rutgers University\nin New Brunswick. Debbie Galant of the NJ News Commons and I\ntalked about the projects that came out of our Hack Jersey\nhackathon. Then I laid out a map for building data skills in the newsroom.\nFor those who attended (and those who didn’t), here are links to some of\nthe tools we discussed and tutorials to start to learn them.\nThe slides: bit.ly/R1C13DATA\nWe started by sharing examples of data-driven news applications on the web:\n\nCrashDataNJ\nBecauseofUs.net\nCost of Radiology in New Jersey\nUSA Today’s “Ghost Factories” project\nWNYC schools waitlist map\nProPublica’s Dollars for Docs\n\nSo how do you do this kind of work (or get to Carnegie Hall)? Practice.\nPractice. Practice.\nA brief detour on the history of data journalism included a data piece\nin the first issue of the Manchester Guardian in 1821 and the cover\nof the program for IRE’s first computer-assisted reporting conference\nin 1993. And now, to today…\nThe disciplines of data reporting\n1. Collection\n\n[PANDA\n    Project][]- a\n    newsroom warehouse for data, with [search\n    alerts][] when\n    new data arrives\n[FOIA\n    Machine][] - a\n    new site to help track FOIA requests\nDocumentCloud\na free tool for journalists to store, annotate, publish and embed\nPDF documents\n\n\nFor scraping\n    web pages - http://www.reporterslab.org/scraping-roundup/\nComet Docs\na free service to scrape PDFs\n\n\nTabula - a\n    new project to help make PDF scraping easier\n\n2. Cleaning\n\nMy go-to cleaning tool for relatively small data sets (less than,\n    say, 10,000 records) is Open Refine. Can’t say enough good\n    things about it. In this blog post are [links to my Open Refine\n    class][] and several others to get you started.\nMaryJo Webster‘s “Excel Magic” class for cleaning data in Excel.\nFor the truly adventurous, check out Dan Nguyen’s great new ebook\n    introducing regular expressions.\n\n3. Analysis\n\nExcel is going to be your favorite tool ever. There are a number of\n    good tutorials on basic Excel and more advanced Pivot Tables [listed\n    here][], as well as a link to a great, free online course\n    introducing databases.\nAnd don’t forget the formula for percent change = (new-old)/old\nOnly for a few more days, you can get 50-percent off of all Excel\n    e-books from O’Reilly here: bit.ly/R1C13EXCEL\n\n4. Visualization\n\nSharon Machlis of ComputerWorld’s great list of [30 free dataviz tools][].\nA favorite for making embeddable maps and charts, Google’s\n    experimental Fusion Tables.\nFusion Tables tutorial (on the second half of the post).\nMore Fusion Tables tutorials.\nTableau Public, another free data viz program.\nDataWrapper, more free charts, powered by your Google Spreadsheet\nGoogle’s new, free Map Engine Lite\nMake searchable, sortable tables and embed them with FreeDive\n\n5. Interaction\n\nThe open source code from Hack Jersey on Github. (Remember the\n    caveat that this is hackathon code and in most cases probably not\n    ready for prime time)\nThe wonderful Source blog from Knight-Mozilla Open News\n\nSupport groups\n\nInvestigative Reporters & Editors\nIRE’s NICAR-L email listfor computer-assisted reporting and data\n    journalism discussion\nHacks/Hackers\nOnline News Association\nAnd for more advanced topics, Chrys Wu’s blog posts rounding up\n    all the tools, classes and workshops at IRE’s CAR conference are must-reads.\n\nWhat are your favorite data techniques, tools and tutorials? Please\nshare them with me. I’d love to check them out.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2013/04/diving-in-to-data-with-spj.html", 
            "title": "Diving in to Data with&nbsp;<span class=\"caps\">SPJ</span>"
        }, 
        {
            "text": "It all started in September, at the Online News Association‘s\nconference in San Francisco. I crashed the [#wjchat][] party and ended\nup meeting the infamous Debbie Galant, the force of nature behind\nBaristanet who was just starting the NJ News Commons. We talked\nabout journalism in Jersey. I floated the idea of a news hackathon, and\nshe was intrigued.\nFast forward through a hurricane, an election, months of planning and\npromotion, and 24 hours of hacking. I sat in a lecture hall at\nMontclair State University listening in awe to 11 teams of journalists\nand programmers pitch their projects to change news in New Jersey.\n[Of course, I’m glossing over many logistical details here. I’ll just\nsay that we could not have pulled it off without the generosity and\nadvice of our sponsors and partners, especially the News Commons and\nthe university, Knight-Mozilla OpenNews, CartoDB,\nO’Reilly, The Star-Ledger, The Record, Patch, Echo\nand many others.]\nI couldn’t believe we pulled it off. There’s no way I could have\nimagined in September how much I’d learn about building community,\nblending cultures and sowing the seeds for us to think about news and\ndata in new ways. Among those lessons:\n\nIt was a serious miscalculation on my part to try to start at 9 a.m.\n    on a Saturday. Neither journalists nor developers are early risers.\n    As we waited for folks to drift in, we had to start late and rush\n    some of the presentations.\nOne of the biggest challenges was trying to manage people’s\n    expectations of what they’d get out of giving up a weekend to stare\n    at a computer screen on a college campus. Some people wanted to\n    learn to code. Others wanted nerds to help them with their next big\n    project. A few, I imagine, wanted to network for a job. We wanted\n    everyone to feel like she or he could be a part of this experience\n    and could offer something, no matter previous experience or skill\n    level. For some newsroom denizens whose only exposure to developers\n    was their much maligned IT staff, this was a revolutionary idea.\n    They have been trained to treat technologists like a deli counter:\n    Order up whatever newfangled internet thing you need and wait for it\n    to show up. My hope was at the end of the hackathon, our reporters\n    and developers could start to imagine how they can work together. I\n    think on that front we succeeded.\nWe may have overloaded the schedule with speakers, and our talks\n    were geared too heavily toward journalists. Some of the participants\n    would have liked more discussion of the process of creating news\n    apps rather than the concepts of data journalism and news app\n    thinking. Others wanted less yakking and more hacking.\nIt’s just as important for us to bring programmers to the news world\n    as it is to introduce journalists to the development process. We\n    succeeded on the latter, but we need to do more for the former. We\n    could have used speakers from the tech world who would have lured\n    more programmers.\nI wish we had more diversity in our roster of speakers. I was\n    thrilled to have Emily Bell as one of our judges. A majority of\n    the folks on our planning committee were women, as were many of our\n    participants. But I think we erred in not having more women\n    presenters, giving a false impression of the state of news\n    development and the programming world as a whole.\nWe just didn’t have enough developers. We needed to have more than\n    one on each team, preferably someone with backend skills and someone\n    else with frontend skills. Some of the teams had one developer and\n    four journalists. That just didn’t work.\nWe found some teams didn’t need more than one or two journalists,\n    even those with significant computer-assisted reporting skills. Some\n    of the CAR veterans had a hard time translating their expertise in\n    analyzing data to the idea of developing a reusable application.\nTo my surprise, many of the programmers were not really familiar\n    with version control or git. Only Sunday morning, as the\n    deadline loomed, did some teams ask about how to use Github, leaving\n    me to run around and teach people. Some teams also didn’t have\n    server space to host a demo site, something I assumed was a given. A\n    suggestion from judge and mentor Jonathan Soo was to have us offer\n    hosted server space for the teams and to require everyone to push an\n    initial commit to Github within the first hour of hacking.\nThe teams with strong projects at the end either came with an idea\n    or settled on one very quickly. We need a mechanism for teams to\n    find members and for people to think about data and project ideas\n    ahead of time. Some teams spent far too much time arguing over ideas\n    or failed to really evaluate the data they were hoping to use.\n    Suggestions were made for a pre-networking event a week before or a\n    forum or email list for people to talk ahead of time.\nI realized far too late that our website was good for displaying\n    details on the event planning, but the blog was completely\n    unusable. The commenting system didn’t work at all. Next time, we\n    need to test that earlier or set up a functional blog at blog.hackjersey.com.\nOf our 11 projects, three teams didn’t finish enough to present\n    anything beyond what they learned from not finishing. Another four\n    teams had very rough demos, but had proofs of concept to show. So\n    four teams finished pretty much functional projects.\nIf you want to build a strong community, the best way to start is by\n    recruiting a broad coalition of journalists, developers, designers,\n    hackers, educators, nonprofits and bureaucrats to help plan the\n    event. Thanks in large part to Debbie Galant, we had more than 20\n    people on our organizing committee, and their ideas and dedication\n    made this hackathon work.\n\nAll in all, I considered our first Hack Jersey event a success. And that\nleads us to think about what’s next. We have a few ideas:\n\nAn ongoing sponsorship from the New Jersey News Commons and the\n    School of Communication and Media at Montclair State University.\nA hack day aimed at scraping a poorly structured public dataset that\n    could be hosted for all to use freely.\nProgramming training, perhaps through a partnership with other\n    groups who have already invented that wheel.\nBasic data reporting training, which many working journalists say\n    they are hungry for.\nSolicit ideas for newsroom tools from news organizations large and\n    small. Take that list of use cases and host a hack day or series of\n    hack days to build open source tools.\n\nWhat do you think Hack Jersey should work on next? What\nwould be most useful to you as a journalist? If you’re a developer, what\nkind of projects would you be interested in working on with us? I’d love\nto hear your ideas. Please share them in the comments, or email us at hackinfo(at)hackjersey(dot)com.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2013/04/organizing-my-first-hackathon.html", 
            "title": "What I learned organizing a&nbsp;hackathon"
        }, 
        {
            "text": "At this week’s computer-assisted reporting conference in Louisville,\nIRE has me doing double-duty. In addition to my class on OpenRefine,\nI’m also teaching a hands-on session on git and Github.\nThis assumes you’ve already downloaded git and created an account on\nGithub. I use the command line, although if you master that, the GUI\nclients will be a piece of cake.\nI’ve somehow, inadvertently become a bit of a Git evangelist, not out of\nany mastery, but mostly because of my convert’s zeal for version\ncontrol.  And the one-two punch of git and Github have changed the way I\nthink about my job, web development and sharing knowledge. Here’s a\nquick run-through of the class. If you’re a visual learner, the slides\nare here: http://bit.ly/car13gitslides\nWhat is git?\n\na distributed version control system (If this doesn’t mean\n    anything to you, don’t sweat it. It’s mostly for the nerds)\na command line utility to track changes to a file and to share those\n    changes with others.\ngood for any kind of text - stories, csv, html, .js, .py, .rb.\nnot so great with images, audio, video\n\nWhat does git do?\nIn a broad\noversimplification, it uses diff to compare every addition and\nsubtraction in your code and shows you how your files evolve.\nIt lets you take snapshots of your code and roll through them over time\n(or back in time) as needed to follow how a file changes from save to\nsave to save. And you can have several authors of a file branch off\ntheir own versions to edit and then later merge them all back together\ninto one master file.\n\nHow does it work?\nThere’s a lot of things going on behind the curtain in git, that you can\nfigure out eventually, but don’t worry about it here. For right now,\nbasically you only need to really know six commands.\nThe first thing you want to know is\ngit status\n\nThis will orient you to where you are, what files have changed and\nwhether you’ve saved your snapshot of your project (which we’ll soon\nstart calling a “commit”). This is your friend.\nWhere you work and where you edit your code is the working directory.\nWhen you’re ready to take a snapshot of your code, you “add” your file\nto the staging area.\ngit add foo.py\n\n\nAfter you’ve made all the changes you want, and you’ve “added” all of\nyour updated files to the staging area, it’s time to make a commit. And\nwith each commit, you want to add a short message describing what the\nchanges are.\ngit commit -m \"finally debugged my own idiocy. maybe...\"\n\nNow all of your updates are saved in your file respository, and if you\nwant to, you can your snapshot is made. You could very easily stop here\nand just keep the audit trail on your machine. But the other half of\nthis happy marriage is Github.\n\nWhat is Github?\n\nGithub\nis a social coding site, and it’s a hosted remote repository.\n\nIt\nlets you back up all of your code online (for free if it’s open source),\nand it lets you see how other developers do it and learn from their work. \nHere’s\nhow you do it: \ngit push -u origin master\n\nYou\n“push” your code from the “master” branch that’s on your machine to your\nremote repository on Github, which we call “origin.” (This may have\nalready been configured for you if you cloned your repo from github.\nOtherwise, you would have to \ngit remote add origin git@github.com:tommeagher/myrepo.git\n\n)\nOne of the many great things about Github is that you can see the diff\nin your files without the Matrix hypnosis of command line.\nThe last couple commands I’ll tell you are how you get your commits from\nthe remote repository on Github back on your machine.\nYou can use\n git fetch origin\n\nto gather the updated files from your remote “origin” repository. Now\nyou want to “merge” the changes from the master branch on your remote\n“origin” repository into your master branch on your machine.\ngit merge origin/master\n\nNow your files are updated from the remote repository. Now keep coding.\nIf you want more, you can visit the repo for this class, where I\nhave a cheat sheet for the most common basic uses and commands and more\nin-depth tutorials.\nThis really just deals with the basics. We haven’t even had a chance to\ntalk about merge problems, branching, forkingor cloning,\nbut you know how to Google, so you can figure it out. Fork my repo,\nimprove the cheat sheet and send me a pull request.\nWhat’s your favorite tip or cheat in git? Leave me a comment. I’d love\nto read it.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2013/03/learning-to-commit-to-version-control.html", 
            "title": "Learning to commit to version&nbsp;control"
        }, 
        {
            "text": "At IRE’s computer-assisted reporting conference this week in\nLouisville, I am once again teaching a course on using OpenRefine to\nclean data. Although the program has changed names over the last few\nmonths, its features are pretty much the same, and it’s still an\namazingly powerful and free tool for cleaning and standardizing\ndifficult data. If you ever find yourself frustrated with typos,\nmisspellings or any number of other mistakes in the data you get from\ngovernment agencies, OpenRefine will change your life.\nI won’t repeat verbatim my Refine tutorial, which you can find here,\nbut I will share some of the resources again and point you to a few\nother tutorials.\nFirst, check out the updated slides for my class. If you’d like to\nfollow along with the class, you can download our data for the lottery\nwinners, the hospital report cards, and the campaign finance\ndata.\nIf you’re just looking for a good cheat sheet of Refine’s key functions,\ntry this.\nIf you thought my class was easy, and you’re looking for more help with\nRefine, I can recommend these tutorials, from Refine creator David\nHuynh, developer Dan Nguyen and journalism educator Paul\nBradshaw.\nWhat’s your favorite use for OpenRefine? Leave a comment here, drop me\nan email or mention me on Twitter. I’d love to hear what you think.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2013/02/more-tips-for-using-openrefine.html", 
            "title": "More tips for using&nbsp;OpenRefine"
        }, 
        {
            "text": "Update: In mid-December, I led two days of training in data journalism\ntechniques for my colleagues at the New Haven Register. On a Thursday\nevening, I took the Amtrak train home to New Jersey, feeling good about\nturning a group of journalists on to the power and fun of incorporating\ndata into their reporting.\nThe next morning, the horrible shooting at Newtown Elementary School\nthrew our world upside-down. Only now, more than two months later, have\nI been able to take a moment to revisit the rough notes and links I\ndumped here in December to try to make them a little more useful.\nThe first class was an overview discussion of “data journalism” and the\nmany and sundry techniques that encompasses. The second class was a\nhands-on walk-through of Excel and Google Fusion Tables. The handouts\nand cheatsheets cover nearly all of the tips we discussed. If you have\nquestions, or would like to know more, please leave a comment or send me\nan email.\nIntro to data -slide deck\nHandouts:\n\nNewsroom math overview\nNumbers in the Newsroom by Sarah Cohen\nNewsroom math crib sheet by Steve Doig\n\nExtra reading\n\nThe roots of “precision journalism”\nHow Jason Hoppin predicted a close local election\nA video of Ben Welsh‘s talk on data journalism. He explains\n    it very well, ”It’s only in journalism that we continue to\n    distinguish ourselves with the use of Microsoft Excel.”\n\n\nHands-on Excel & Fusion Tables class\n\nData for Excel exercises\n\nSchoolsdatav1.xlsx\n2010-2011hs-prresults.xlsx\nDemographicSnapshotEdited.xlsx\nAppointments.xls\nCrony.xls\ncitybud.xls\n\nLet’s do something fun and map the data for a story, using Google’s\nexperimental (and free) Fusion Tables program. We’re going to\ndownload a spreadsheet in the CSV format of the violent crime rates for\nevery town in Connecticut.\nGo to DataHaven.org Go to indicators>Public safety>Community\nsafety>Violent crimes> total violent crime rate\nSelect all towns and hit the submit button. Click “All years” and hit\nsubmit again. Now you can download the CSV, which stands for\ncomma-separated values. It’s essentially a spreadsheet without any of\nthe fancy highlighting or formatting of Excel. It’s a universal format,\nand when given the option, it’s a good idea to get your data in CSV.\nBecause of its simple structure, it’s easy for a human to read and just\nabout any computer can understand it.\nNow, we have our data, but if we want to visualize it, we need a map to\nput it on. We can get this map from a SHP (pronounced “shape”) file.\n Luckily, in many states, the government or academic institutions often\nhave a clearing house for this kind of geographic data. In Connecticut,\nyou can find it at the U. Conn. library. Point your browser toward\nhttp://magic.lib.uconn.edu/, then look under the “CT GIS” column and\nclick on the “Boundaries“ section.\nGrab the “Connecticut Towns” shapefile from 2010. Then you have to\nconvert the file to a format that Fusion Tables can use. Luckily, there\nis a free website called “Shp Escape” that can help. Give it your\nshp file and log into your Google account and it will automatically\ntransform the file and ship it into your Fusion Tables account. Some\ntimes the site can be a little busy, so it may take a few minutes. Be patient.\nNow, that you have your map file in Fusion Tables, you need the data you\nwant to visualize. Go to Google Drive, click the “create” button and\nchoose Fusion Table. Choose the “download.csv” file that you got from\nData Haven and put this into your Fusion Table. (Notice, Fusion Tables\nalso allows you to import tabular data directly from a Google Spreadsheeet.\nClean up the column headings in the file to make the more meaningful.\nNow we’re going to merge the data file back to the shape file we already\nuploaded. Under the “File” dropdown menu, choose “Merge.” Find your\nConnecticut Towns shape table. And you have to determine which field to\njoin the tables on. What field is the same in both tables? Notice that\nthe “town” field in the crime table matches the “NAME10” field in the\nshape file. That’s your key to join the tables together. Just be certain\nthat each town name only appears once in that column in each table (in\nthis example, it does).\nOnce it sends you into Fusion Tables, click the “About this table” link\nunder the File dropdown menu and “edit table information.” Update the\nname of the table, give it a meaningful description, attribution and a\nlink to the original download. This can help you later to retrace your\nsteps and bulletproof your reporting. It will also help others who look\nat your work and want to see your primary source material. Click on the\n“Share” button and make the map public.\nWe have both tables combined together into one, new, merged table. But\nif you click on the “Map” tab, it probably still doesn’t look right. We\nneed to style the representation of the data. While you’re on the map\ntab, go to the “Tools” dropdown and click on “Change Map Styles.” This\nwill allow us to choose how we want to color code the towns based on\ntheir crime rate. Instead of points, we want to click on “Fill color”\nunder the “Polygons” section. Points would be if we were color-coding\npins on individual addresses. Instead, we want to shade an entire town\nbased on its crime rate, thus we want “polygon.” For the fill color,\nlet’s pick the “buckets” tab, which means we can choose four different\ncolors to represent the range of crime rates in our area. If you want to\nfancy, you can choose whatever color you want for each bucket. Hit the\n“save” button. Are all of your towns filled in with a color? (You can\nignore the “Southwick Jog“). If not, then you probably haven’t set\nthe range of values for your crime rate to the include all of them.\nAdjust the high and low ends of your range until none of your towns are\nblank. This may take some jiggering.\nPlay with the bucket sizes and colors of the buckets. What makes sense?\nIs everything in there?\nClick on the title to change the attribution and background info for the\nmerged table. Share the merged table and make it public. Then click\nTools> Publish. This gives you the embed code for you to put it in your story.\nOnce you get the hang of this, you can but producing web-ready\ninteractive maps in 20-30 minutes, a task that would have taken hours or\ndays not all that long ago. This is an awesome tool.\n\nThere are a few more things that you can tweak, if you like. You can go\nto Tools>Change info window layout, to tweak the information that’s\ndisplayed when you click on a polygon.\nAnd one last tip, you don’t always have to upload your own data or map\nfiles. You can go to Help>Search Public Tables and browse through all\nof the data that other Fusion Tables users have uploaded. Of course, as\nwith all reporting, the caveat is to mindful of the source. Always\nconfirm the information and data with other parties. But if you find a\ngood shapefile, you could use it again and again. It’s definitely worth exploring.\nThat’s the super fast and dirty introduction to Fusion Tables. Now, go\nexplore it some more on your own. What’s your favorite trick in Fusion\nTables? Drop me an email, leave a comment or mention me on Twitter and\nI’ll add it here.\nTipsheets and tutorials\n\nGetting around Excel\nSorting in Excel\nPower formulas in Excel\nExcel filters and pivot tables\nMore Fusion Tables tutorials\nExamples of cool uses of Fusion Tables\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/12/talking-data-in-the-nutmeg-state.html", 
            "title": "Talking data in the Nutmeg&nbsp;State"
        }, 
        {
            "text": "There are few things more frustrating than trying to get a simple\nspreadsheet from a government agency and being told by a spokesman that\nthe data (say, a table of property tax rates in municipalities that was\nclearly created in Excel) only exists in a locked PDF format.\nFor the sake of expediency, you sometimes just have to bite the bullet\nand try to wrestle the data free from the PDF’s clutches so that you can\ngently guide it into a more useful spreadsheet.\nIt’s not always easy, but here are a few resources to do just that:\nDan Nguyen at ProPublica crafted this very helpful and comprehensive\nguide to the various strategies for unlocking data from PDFs.\nI’ve also had some success using CometDocs, a free site that had a\nsurprisingly high accuracy rate for converting documents on one\nparticularly labor-intensive project.\nIf you’re not afraid of installing a simple command line program, I’ve\nalso had some luck with PDF2text. Here’s a nice tutorial from IRE\n(looks like the link may be temporarily broken), as well as a guide to\nhow to automate the conversions and not be bothered by the pesky\ncommand line.\nI’ve heard good things about the commercial software DeskUnPDF, but\nI haven’t had an opportunity to use it myself.\nWhen you don’t have the time or patience to negotiate with an agency to\ngive you what you want how you want it, give these solutions a try.\nIf you have other techniques for culling data from PDFs, please share them.\nGood luck!", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/08/pdfs.html", 
            "title": "Not another blinking&nbsp;<span class=\"caps\">PDF</span>!"
        }, 
        {
            "text": "This is another in the series of “Best Practices” posts from my\narchives from the Herald News. This was also written by Jonathan\nMaslow, and offers some solid street reporting tips for counting the\ncrowd at any large public event.\n\nNews reporting often involves telling how many people took part in or\nattended an event. Sometimes the seating capacity is known, as in the\ncase of a sports stadium. Sometimes an official estimates the crowd\nsize, sometimes the organizers estimate. Sometimes they don’t agree.\nSometimes no one estimates.\nIt’s a good practice for the reporter to do his or her own estimation in\nall cases.\nFor inside events, a quick head count with a qualifying “about” is good.\n(“about 75 people attended the planning board session.”) The tried and\ntrue method of estimating crowd size is as follows:\n1) make a careful measurement of the area in which the event takes\nplace. Simply put, that’s length times width equals square feet.\nIn some cases, it may take a slightly more sophisticated algorithm (the\ncrowd covers the sidewalks on six blocks. Ask officials how long each\nblock is, walk off the width of sidewalk. Multiply).\n​2) Decide whether it’s a dense crowd or a loose crowd. People packed\ninto a subway car, for example, are a dense crowd and occupy 2 square\nfeet per person. A loose crowd, such as a parade of journalists on May\nDay, has one person per five square feet.\n​3) Divide the area by the crowd density, and you’ve got your estimated\ncrowd.\nExample: A political rally takes place in the square outside City Hall.\nYou pace it off and find it’s 150 feet long and 100 feet wide, or 15,000\nsquare feet. You wade into the crowd to test the density. Some places\ntoward the front are packed, but in the back it’s loose. You choose a\ndensity in between of one person per three square feet. Divide 15,000 by\n3 = 5,000 people.\nTo recap:\n\narea: 150 x 100 = 15,000\n estimate of density: 3 sq. feet/per person\n 15,000 divided by 3 = 5,000 attendees\n\nIf AP is covering an event, check your estimate against theirs, which is\nbased on aerial/satellite photography and should be accurate. If yours\nand theirs are at great odds, dig in your heels and insist the wire\nservices are an ass.\nNote: [Then] Passaic County Sherriff’s communications man Bill Maer says\nthe county uses a slight variation:\n\n​1) Count how many people are actually in a 10 x 10 foot area (that’s\n100 square feet).\n​2) Measure on foot or get a good estimate of the size of the entire area.\n​3) divide the total area by 100 (the number of 10 by 10 squares)\n​4) Multiply the result by how many people are in the sample 10 x 10\nfoot square.\n\nPersonally, I think this adds an unnecessary step, but it does make the\nreckoning of density a bit more accurate and hence, perhaps, the crowd\nestimate itself.\n\nJonathan Maslow, Herald News, Nov. 2003\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/07/crowd-estimates.html", 
            "title": "How to get a head count at the&nbsp;parade"
        }, 
        {
            "text": "It seems odd in 2012 that in some newsrooms the data journalists don’t\nget the same kind of credit for their work that other reporters receive.\nI suppose it’s understandable, if NICAR-L is any indication, because to\nsome of our colleagues data work is a mysterious and opaque contribution\nto a story and thus they don’t quite know how or when to give us a byline.\nThis is the policy we used when I was the CAR reporter at the Herald\nNews, and it was heavily modeled (in some parts verbatim) on the one\nadopted by Rob Gebeloff, then of The Star-Ledger and now at the New\nYork Times. This slightly updated policy also guides us today at The\nStar-Ledger as we decide when our work merits a byline. It’s a good\nplace for newsrooms to start the conversation about the work of their\ndata people.\n\nThe data journalist is available every day for assistance, large and\n    small, on daily, breaking and enterprise stories. The reporter is\n    here to help locate data. When another reporter or editor asks for a\n    quick fact here or there (such as a basic Census figure), no credit\n    is necessary. It’s part of the job.\nMany times, the quick fact search turns into an analysis of data.\n    When this analysis produces “proprietary information” that supports\n    a story, the data journalist should receive a tagline on the story.\n    For example, a colleague wants a complete breakdown of Census data\n    for a particular neighborhood—a task that would require the reporter\n    to assemble the data piecemeal from several tables or sources—this\n    would create proprietary information unique to our news gathering.\n    If this information is even just a few paragraphs of the story, a\n    tagline is appropriate.\n\nIf the data journalist does a significant analysis of data that\n    creates proprietary information that becomes the thesis of a story,\n    he or she will receive a byline.Even if the data journalist\n    does not write another word in the published piece, his or her\n    reporting forms the basis of a story and thus warrants a\n    byline. \n   For example, the journalist analyzes a new set of data released by a\n    government agency and finds that homeowners in suburban Passaic\n    County are scooping up flood insurance hand over fist. The reporter\n    assembles the analyzed data and passes it on to the real estate\n    reporter who finds additional sources for quotes and writes the\n    story. The nut graf of the story should say “a Herald News analysis\n    of TK data has found…” and the data journalist shares the byline\n    with the other reporter.\n\n\nTom Meagher, Herald News, July 2006, via Rob Gebeloff at The Star-Ledger\n\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/07/nerds-need-credit-too.html", 
            "title": "Nerds need credit&nbsp;too"
        }, 
        {
            "text": "Sometimes, especially after a particularly trying election night, it\nstarts to feel like we may be suffering from post-polls PTSD.\nFor the past year and a half, we’ve been experimenting at The\nStar-Ledger with ways to improve how we report election results online\nand in print. In many elections, we’ll have hundreds of races spread\nacross a dozen counties. And none of the officials overseeing those\nelections provides a useful electronic feed of results.\nWe’ve tried off-the-shelf products to input election data into tables\nwith disastrous, near-comical results. Without a single developer in our\nnewsroom, we’ve cobbled together solutions and written hundreds of lines\nof code to reverse engineer our hand-collected data and take it from our\nwebsite into our print pagination system. For something that’s over in\njust a few hours, we invest an incredible amount of time and effort into\ngetting it right, often without being really satisfied with the product.\nAll of that struggle has led us here, to our proposal for the Knight\nFoundation’s News Innovation Challenge for a project we’re calling\nVOTER.\nVOTER is a browser-based program that will help organizations streamline\nthe collection of election results and create embeddable online graphics\nthat will work on any website, especially the common blogging platforms\nthat power many news operations. It is still very early in the\ndevelopment process, but we’re excited about the News Challenge and even\nmore psyched about the possibility that we can turn our trauma into\nsomething that will save newsrooms everywhere a whole lot of heartache.\nWhat do you think? We’d love to hear your experiences, both good and\nbad, from the election nights you’ve covered. What’s worked for you to\nget results online and what hasn’t? Leave a comment here or tweet at\nme. And, most importantly, tell us what VOTER will need to do to make\nit useful for your organization.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/06/waking-from-the-election-results-nightmare.html", 
            "title": "Waking from an election results&nbsp;nightmare"
        }, 
        {
            "text": "Back at the Herald News, several of the editors and reporters wrote a\nregular series of columns for the newsroom called “Best Practices.” In\ndigging through my archives, I’ve found several that are timeless that I\nwill gradually repost. This first one was written by Jonathan\nMaslow, and his tips for being transparent in our reporting and\nwriting continue to ring true.\nOur credibility as journalists and as a newspaper is the most important\nequity we have in the marketplace of ideas. The more readers trust us,\nthe better our performance. We have to earn that trust every single day.\nOne of the most important ways to do this is leveling with our readers:\ntelling them what we know, how we know it, what we don’t know, why we\ndon’t know it and what’s what. In practice this entails the highest\ndegree of transparency possible in our publication.Work toward greater transparency:\n​1) Don’t use hearsay. Don’t describe things you didn’t see, but rather\nattribute it to a firsthand witness and tell the reader who that witness\nwas. If you are writing about a public meeting you did not attend, be\naware that readers must not be given a false impression. You don’t need\nto say you weren’t there. But you can’t report things as if you were there.\n​2) Don’t just use the boilerplate “sources said,” but give the reader\nas much information as you can without breaching trust, for example:\n“two sources in the AG’s office familiar with the case,” or “a high\nofficial in the department who asked her name not be used because she\nfeared political retribution.”\n​3) Don’t just use the cliche “the mayor could not be reached for\ncomment.” Use instead: “the mayor did not return repeated phone calls\nfor comment over a three-day period, although City Hall said he was not\non vacation or out of town on business.”\n​4) As you know, we sometimes have problems getting information from\npolice on weekends. Don’t just let this go with “police did not release\ninformation.” Tell the readers, e.g., “Sgt. Troy Anthony said he could\nnot release any information about the incident, because Mayor Sammy\nTorres, who is also acting public safety director, has told the police\ndepartment that all news releases must go through his office. The mayor\ndid not return five phone calls Sunday.”\nTransparency is a habit, a muscle. Flex it and it gets stronger. And\nyour work gets more accurate, better, more useful to readers.\n\nJonathan Maslow, Herald News, June, 2004\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/06/transparency.html", 
            "title": "Bolstering transparency in our&nbsp;reporting"
        }, 
        {
            "text": "*Updated: I added the link to the rough cheat sheet of handy and\ncommon Refine tasks at http://bit.ly/ire12refinecheats. Send me your\nfavorite tricks to add to the list!*\n\nThis is a rough walkthrough of the\nclass I’m teaching at the 2012 IRE\nconference in Boston on how to use\nGoogle Refine to clean data. If you’d like to see them, these are the\nslides from the session,\nhttp://bit.ly/ire12refineslides.\nPlease forgive the weird line returns of WordPress. If you hit any\nhiccups or have suggestions for improvement, please leave a comment or\nmention me on Twitter\n@ultracasual.\n\nYou’re faced with a dilemma that’s fairly common in many newsrooms.\n\nSay, for example, a series of accidents kills a number of children\ncrossing busy streets near you. Now, you want to know the deadliest\nroads or intersections in your area (this is not the dilemma, just wait\nfor it). \n\nWe always say in the news business to check it out, and we shouldn’t\ntrust anecdote and the frailty of human memory.  So where do you go?\n\n\n\n\n\nDoes this guy, right, look like he has an encyclopedic knowledge\nof every fatal accident in your five-county coverage area?\n\n\n\nFile a public records request and get the data. It should have the\nanswer you need, right? You pick up your CD with the data, or if you’re\nreally lucky, the state police will have a file you can download from\ntheir website. You expect to get a tidy Excel spreadsheet with very\norderly numbers on it. Everything will be geocoded, and you’ll just need\nto do one quick pivot table or one quick group-by query and drop it into\n[Fusion Tables][] and BAM! you’re done with your story. It writes\nitself, right?\n\n\n\n\n\nYou laugh, but this is what I spent years believing, and every time I\nwas—and continue to be—flabbergasted by the sloppiness of the public\ndata I get my hands on.\nWhen I worked on the dangerous intersections story, I got something that\nlooked like this:\n\n\n(This is a dramatization)\n\nAs David Donald said in his CAR panel yesterday, cleaning is the longest\nand hardest part of the data process. Assume any data you get is dirty\nand full of holes.\n\nGovernment data is hardly unique in this respect, but it is our bread\nand butter, and frankly we should expect better from the government, so\nI’ll pick on it today.\n\n\nWhy is so much public data such a mess?\n\n​1. Much like journalists, government agencies are not nearly as good\nwith numbers as they ought to be.\n\n\n2. When databases exist, they are often built on things never\nintended to be turned into relational data, like hand-written accident\nreports.\n\n3. Many agencies seem to subscribe to the[infinite monkey\ntheorem][].\n\n\n![][2]\n\n\n\n\nFor anyone unfamiliar with it, the infinite monkey theorem more or less\nsays that given an infinite amount of time and an infinite number of\nmonkeys with typewriters, eventually the monkeys will write the complete\nworks of Shakespeare or “A Tale of Two Cities.”\n\n\n\n\nWhen you work with a lot of public data, this is what feels like.\nOccasionally there’s something correct, but before you find it, you have\nto wade through what seems like a near-infinite number of errors.\n I’m not suggesting that government employees are\nprimates, but I am pretty certain that they’re outsourcing their data\nentry to monkeys… and it gets worse.\n\n\n\n\n\n\n\n\nBecause these monkeys are not geniuses.\n\n\n\n\nThey are enemies of good data.\n\n\n\n\n\nThese monkeys are mean, and they hate puppies and clean data (and\nwater). To be fair, in my completely unscientific survey, the data has\ngotten better in the past decade, but it’s not where it should be.\n\n\n\nEvery data entry mistake possible will be made. Often you fill find new\nmistakes that you never, ever would have considered or imagined in your\nwildest dreams.\n\n\n\n\nThese clerical errors will make your life miserable. You can\neither welcome our new monkey overlords or you can arm yourself.\n\nThe old tools\n\n-   Excel: filters, pivot tables, string functions\n-   Access: Group by queries\n-   Notepad++: Regular expressions\n-   Scripting language for automated, repetitive cleaning\n\n\n\nWith these, the cleaning of the database could take days or weeks or\nlonger.\n\n\n\nNow you can do it with Google Refine in a few hours or less.\n\n\n\n\nIt can take that crap and turn it into a diamond.\n\n\nWhat is Refine good at?\n\n- Transforming data, either on individual cells or whole columns at a\ntime\n\n\n\n- Clustering data to find similar values that repeat for exploration and\ncleaning\n\n\n- And many, many other tasks.\n\nRefine does a lot of really amazing things, and this class will give you\njust a tiny taste. It can help high-level programmers with repetitive\ntasks, and it has its own expression language for accessing and\nscrubbing data. But it is also a great tool for the less technical set.\nIf you’re comfortable with Microsoft Excel, you should be right at home\nwith Refine. You don’t have to be a comp sci PhD to love it.\n\nThe two big areas we’re going to concentrate on today are clustering\ndata and transforming it\n\n\nSo let’s get started. Here are instructionsto install Refine on your computer.\nWe’ll start with a dataset of lottery winners from New Jersey. Say you\nwant to know what areas spend the most on lottery tickets but win the least.\nDownload the lottery dataset here.\nRefine runs through your web browser, but don’t worry, it works offline\nas well.\nYou can import a table file in many formats, either from your computer,\nfrom Google Docs or from a URL for a file on the web. Once you have\nRefine running, click “Create Project.”\nYou’ll see a preview of what the data looks like. When you pull in the\nCSV of lottery data, make sure to uncheck the “Parse cell data…” option.\n\n\nNew Jersey zip codes start with zero. If Refine guesses that column is a\nnumber, it will drop the leading zero, so unchecking the option will\npreserve the zips as text.\n\nWith this data, we’re going to use Refine to clean up the W\\_TOWN column\nto standardize the names of municipalities. But we never want to work\nwith the raw data, so let’s copy the column that we’ll actually\ntransform into something usable. So click on the arrow at the top of the\nW\\_TOWN column and choose the Edit Column\\>Add column based on this\ncolumn option.\n\nEnter a name for the new column. We’ll use “TOWN.” Original, I know.\n\n\n\n\nNow, initially Refine will only display 10 rows, but there are 3,100 in\nthis dataset, so let’s look at a for more. Click the number 50 next to\n“Show as” to see more.\n\n\n\nIn Excel, one of the first things you’d do with a dataset is sort it. So\nclick on the arrow at the top of the TOWN column and choose “Sort” from\nthe options. Now,  you can filter out just a few records. Click on the\narrow and choose “Text Filter” from the options. You’ll see a box pop up\nin the left column. Type in Atlantic and see how it plucks out only the\ntowns with “Atlantic” in the name: Atlantic City, Atlantic Highlands,\nAtlantic High and West Atlantic City. As you might guess, not all of\nthese are real towns.\n\n\n\nLet’s lose the filter. Click on the X in the upper left corner of the\nfilter box. Now, we’re going to add a Facet\\> Text facet. Dan Nguyen\nat ProPublica calls Refine’s faceting “the better way to filter.” He’s\ntotally right.\n\n\n\nThe facet will create a box in the left column with the total number of\nchoices and a list of all the possible choices in this column and the\nnumber of each. You’ll see there are 608 options. At the top is\n“ABERDEEN” with 3 occurrences. Scroll to the bottom and click on “Facet\nby choice counts.” This will create another box that will let you\ndisplay only the choices that occur a certain number of times. It shows\nthe range of values in a column and helps you to spot anomalies or\noutliers. For instance, if you move the boundaries to only show the\nchoices with between 120 and 140 uses, you’ll only see “JERSEY CITY” and\n“NEWARK” rows. Close the “Facet by choice counts” box.\n\n\n\nScroll through the text facet box a little ways into the Bs. See the\noption for “BELEE MEAD”? It has one occurrence. Notice that two lines\nlater appears “BELLE MEAD,” the actual name of the town. If you hover\nover “BELEE MEAD,” you will see the option to “edit” appear to the\nright. Click on that and then fix the spelling of the name in the box\nthat appears. Notice that the choice count drops to 607.\n\n\n\n\nLet’s look at another way to clean data. Scroll down a few more lines.\nNotice that there are two lines in a row for “BERKELEY HEIGHTS.” They’re\nspelled the same, so why are they listed separately? Because one of them\nhas an extra space at the end of it that screws up the grouping. This is\nthe kind of thing that back in the bad old days would make you throw\nyour PC out the window two weeks into a data project. Instead, let’s get\nrid of all the extra, invisible spaces. Click at the top of the TOWN\ncolumn, edit cells\\> common transforms\\> Trim leading and trailing\nwhitespace. Notice again how the choice count dropped. We’re down to 573\ntown names now. We’re getting there.\n\n\n\nSo you could spend hours scrolling through and eyeballing similar names\nand editing them by hand using these methods, or we could unleash the\nreal power of Refine: clustering.\n\n\n\nClick on the “Cluster” button in the facet box. Click it and you’ll see\nsomething like this. The default method is “key collision.” That should\nonly show a couple of options. Try changing it to “nearest neighbor.” I\ncan’t exactly explain the algorithm behind it, but it’s obvious that it\nfinds town names with similar names that should probably have the same\nname. You see similar sets like “POMPTON LAKES” and “POMPTON LAKE” or\n“E. ORANGE,” “E ORANGE” and “E.ORANGE.” Click the “merge” button next to\neach grouping and type the name you want them all to be changed to in\nthe “New Cell Value” column and hit the “Merge selected and recluster”\nbutton at the bottom. You’ve just cleaned those messy columns to a\nsingle value.\n\n\n\n![cluster][]\n\n\nScroll through the list, reclustering and editing whole chunks at a\ntime. This is a huge time saver. When you’re done with the “nearest\nneighbor” clusters, experiment with “key collision” and see if it picks\nup any other similar names.\nNow, keep in mind that to get this right, you’ll have to do some\nadditional reporting. You’ll need to be certain that “NORTH BRUNSWICK”\nand “NPRTH BRUNSWICK” are indeed the same place and not separate values\nas they came to you. If you’re confident in your reporting, Refine makes\nthe data cleaning easy.\nWhen you’re satisfied that you’re done, click on “Export” on the upper\nright corner. You can output the file as html, TSV, CSV, Excel or any\nnumber of formats. Pull it into your favorite spreadsheet program and\nrun your analysis. Then run it all again to make sure you got it right.\nTo be certain, start from scratch and triple-check it.\n\n\nAs cool as this is, Refine has a few more tricks for the beginner. Let’s\nlook at this file of [NJ hospital report cards][].\n\n\n\nCreate a new project and import it into Refine.\n\n\n\nAnything look weird? How about that first column. Seems like it includes\ninformation we’d probably want to split into several columns. In Excel\nyou’d do this with a series of nested functions. In Refine, we can do it\nwith a single click. At the top of the “Hospital” column, choose the\ndrop-down menu and Edit column\\>Split into several columns…\n\n\n\nWhen the wizard menu pops up, choose  a semicolon as the separator and\nuncheck “remove this column,” because we always want to be compare\nagainst our original data, right?\n\n\n\n\nSo this looks better, with the name, street, town, state and zip code in\nseparate columns. But something isn’t quite right. What about the zip\ncode? Why is it only four digits? Oh yeah, New Jersey zip codes start\nwith zeroes. Refine assumed that column was an integer and lopped off\nthe zero at the front.\n\n\n\nAnother great feature of Refine is that it logs everything you do with\nthe dataset. When you make a mistake or you want track back through your\nwork, click on the “Undo/Redo” tab at the top of the left column and you\ncan tiptoe back through your process.\n\n\n\nLook at the list and click on the item at the top, “0. Create project”\nto jump back to that step.\n\n![undo][]\n\nNow, redo the “Split into several columns…” step and this time uncheck\n“Guess cell type” to preserve the zips as text.\n\nBe sure to make note of the undo option at the top of the screen. You\ncan move a single step back at any time by clicking on this, much like\nthe undo prompt that appears in Gmail after you archive or delete a\nmessage.\n\n\n\nFinally, notice that the names of the hospital are inconsistent. Some\nare all uppercase. Others are only upper-cased. Let’s standardize them.\n\nClick on the arrow at the top of the Hospital column and choose Edit\ncells\\> Common transforms \\> To titlecase.\n\n\n\nVoila. A cleaned dataset. You’re welcome.\n\nLet’s try one last dataset, this one looking at contributions from\nNassau County, N.Y. police unions to political candidates.\n\nImport the data into Refine and let’s start by trying to clean up the\ntown names.\nAdd a text facet to the City column. Click Edit cells> Common\ntransforms> trim leading and trailing whitespace\n\nSee the count change from 240 to 238.\n\nNow, let’s cluster the city names to see if we can consolidate any\nentries.\n\n\n\n\nHow do you see the count change in the city column?\n\n\n\nNow, let’s turn our attention to the Name column. For this exercise,\nlet’s start by adding a filter on the city and just looking at “Albany.”\nYou can also do this by clicking on Albany in the text facet box.\n\n\n\nKeep in mind  that any changes we make from here on out will only affect\nthe “Albany” subset of the data until we clear this filter (or facet).\nNow, add a text facet to the “Name” column. Browse the first few\nentries. Notice there are a lot of very, very similar names here.\n\n\n\nFor the sake of argument, let’s say we’re interested in looking at how\nmuch Sen. Joe Bruno got from Nassau police groups. There appear to be 10\ngroups here with similar names receiving donations for Bruno. Seems like\na good chance that many of these are the same organization. For the sake\nof argument, let’s say your reporting shows that yes, these are the same\ngroup and we want them to all have the same name for our analysis. Hover\nyour cursor over each one and when the option to “include” appears on\nthe right, click it. Once you’ve “included” them all, click the cluster\nbutton.\n\n\n\n\nThis will attempt to cluster the choices just in this selection to offer\nsuggestions on names that could b the same. Change the method to\n“nearest neighbor” and the distance function to “PPM.” If you merge all\nof the offered suggestions under the same name, it will condense six of\nthe 10 choices into one name. Then you can merge and re-cluster. Once\nyou clean up all the suggestions, you can browse the data in the facet\none last time and clean up any stragglers individually as needed.\nBelieve it or not, Refine has just saved you a massive amount of time\nand energy.\n\n\nWhat did we learn here today?\n\nRefine is a huge time saver and allows you to do commonly tedious data\ncleaning tasks with a few clicks of the mouse. We saw how to:  \n- Import and export data.  \n- Copy and edit columns, trimming whitespaces or changing the\ncapitalization.  \n- Use facets to filter and edit data  \n- Cluster a column to standardize spellings and entries.\n\n\nThis has been a whirlwind sprint through this program, but hopefully\nit’s given you a taste of what it can do.\n\n\n\n\nIn an ideal world, we’d get all of our data handed to us perfectly clean\nin easy to access, user-friendly, real time feeds that make for simple\nanalysis and display.\n\n\n\nBut until then, we’re going to have to wrestle with the murky and messy\ndatasets produced by those infinite monkeys making an infinite number of\nmistakes. Use Refine as your new big gun and never give up the fight.\n\n\nAnd remember, if you let the monkeys who enter data into government\nspreadsheets win, this is where it will lead.\n\n\nThey’ll make a monkey out of you too.\n\n\n\n\n\n\nFinally, if you want to keep messing with Refine, here are a pair of\ntutorials that put it much better than I can.\n\n\n\nDavid Huynh, Refine’s creator:\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/06/clean-data-is-the-best-weapon-against-the-planet-of-the-apes.html", 
            "title": "Clean data is the best weapon against the monkey&nbsp;insurrection"
        }, 
        {
            "text": "*Updated on 6/23: I’ve included, marked by an asterisk, several\nfantastic checklist suggestions offered by David Donald at the IRE ‘12\nconference in Boston.*\n\nMuch like surgeons, journalists who work with data can always use help\nensuring they’re getting things right. I compiled this checklist of\nquestions I ask myself whenever I work with a data set. It’s evolved\ninto a tool that The Star-Ledger data team uses on every story we write.\n\n\n\nWhere did the data come from?\nWho created it? Is this the best source for this data? What was\n    the methodology behind its collection?\nWhat documentation came with it?\nDid you read the documentation?\nIs there a record layout or data dictionary?\nDid you save an original copy of the database if you need to\n    retrace your steps?\nAre your field headings accurate? Do you have the columns labeled correctly?\nAre you looking at the correct tab? Is there additional data in\n    other tabs in the worksheet?\nHow many records are in your table or database? How many should be\n    there? Are there any missing? Too many? Any chance you maxed out\n    the number of fields the software can handle?\nAre there duplicates in the records?*\nExamine each column of data one at a time. Is it formatted in the\n    appropriate manner? Are there any gaps in the column? Are any data missing?\nHave names and entities been cleaned and standardized?*\nCheck the aggregation. How was it done?*\nWhen joining tables, are you certain the join worked? How many\n    records are there now? Too many? Not enough?\nWhen pasting tables with common columns side-by-side in Excel, do\n    they line up? Any chance two records might be switched?\nWhat calculation are you trying to do? Are you using the\n    appropriate formula or function for this task?\nDo your cell/column references in functions point to the right\n    places? Are any columns transposed? Can you trace the formula’s\n    path? Have you pasted the correct formula all the way down the\n    column to the bottom of the table?\nWhen sorting, did you sort the entire table together and not omit\n    any columns?\nWhen pasting, is it a good idea to Paste Special>Values to strip\n    out any pesky underlying formulas that may become misdirected?\nWhen moving columns, were there any \\$ anchors that you pasted\n    that now point to the wrong column or row of data and throw off\n    your calculations?\nDoes your calculation make sense?\nAre you looking at outliers or values in the middle of the pack?*\nIs there an expert—either an agency data guru or academic—who\n    has vetted your process or calculations?\nHave you verified your records against the original records or a\n    sample thereof?*\nHave you spot-checked individual records to ensure the numbers\n    match up? Did you ask a colleague to assist by reading off numbers\n    to be CQ’d?\nHave you asked an uninvolved colleague to look at your process,\n    review the numbers and poke holes in the methodology?\nCan you reproduce your calculations from the beginning or explain\n    step-by-step how you arrived at your conclusion?\nWhat numbers are you using in the story? Have you circled them and\n    reviewed them in the database? Is the description of the numbers\n    accurate? Does it omit any pertinent details that might mislead an\n    unwary reader?\nAre the numbers here based on counting, estimates, projections or guesses?*\nAre there any graphics with the story? Have you checked them? Can\n    you verify every number? Are the introduction and column heads\n    accurate? Are there numbers missing from the graphic that are\n    important to the story?\nIs there a methodology/nerd box to run with the story?*\nHow did you get here, and does it make sense?\n\n\nPrint a copy of the checklist.\nHow do you bulletproof your data work? At the 2012 NICAR conference in\nSt. Louis, Tom Johnson and Cheryl Phillips led a seminar discussing\ntheir tips for validating data. I’d really like to hear any advice\nor ideas you’re willing to share. Leave a comment here with your\ntechniques or tweet at me.\n* indicates questions added after hearing David Donald speak about\nbulletproofing CAR work at IRE ‘12 in Boston.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2012/06/checklist.html", 
            "title": "Checklist to bulletproof your data&nbsp;work"
        }, 
        {
            "text": "We have a job opening up on our CAR team here at The Star-Ledger.\nI’m not even going to try to compete with Matt Doig’s hilarious and\ninfamous job post, but I will preface this by saying the Ledger is a\nvery good place to work.\nWe’ve got great journalists here who make a habit of exposing the\nmind-boggling arrogance, greed, incompetence and corruption of the\nGarden State’s public officials. One of our colleagues just won a\nPulitzer  in feature writing for her investigation of the\nsinking of a small fishing vessel that killed six men. We’re led\nby top-notch editors who care about writing and about watchdog\njournalism that gets results.  My (relatively) new team is starting to\ndo some cool work, and we have an ambitious agenda for the year ahead.\nI’m looking for strong candidates soon. Please pass this along to\nanyone you think might be qualified. Here’s the job description:\n\nThe Star-Ledger is looking for a journalist to fill an entry-level\nposition on its computer-assisted reporting team. The reporter will be\nresponsible for acquiring and analyzing public records and data to\nsupport enterprise stories for print and online. He or she should be\ncomfortable filing public records and freedom of information requests\nwith agencies at the local, state and federal levels. The reporter\nwill also contribute to the redesign and maintenance of NJ By The\nNumbers, our home for databases and statistics vital to New Jersey readers.\nQualifications: A background in local or investigative reporting for a\ndaily news outlet and an affinity for math, web development and\nprogramming. Ability to identify and mine public databases for\nstories large and small and to build and manage relational databases.\nExperience displaying data graphically in print and online to engage readers.\nProficiency with Microsoft Excel and Access, SQL, HTML and CSS, ESRI\nArcView and Google Maps. Bonus points for candidates who have\nexperience or interest in scraping, scripting, frameworks (Django,\nRails, ASP.Net) or statistical analysis with SPSS, SAS or R.\n\nIf you’re interested, send me a cover letter, resume and clips to my\nwork email, tmeagher(at)starledger(dot)com.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2011/06/help-wanted.html", 
            "title": "Help&nbsp;Wanted"
        }, 
        {
            "text": "About six months ago now, I started a new job, taking over as The\nStar-Ledger’s Computer-Assisted Reporting Editor. For anyone who follows\nme on Twitter, this may help explain why many of my online comments\nlately have dealt with statistics, data visualizations and programming.\nIn a slight departure from my day-to-day role working with numbers, I\nwas asked to fill in for one of my bosses at a symposium hosted by John\nJay College’s Center on Media, Crime and Justice. The round table\ndiscussion brought together police and journalists from across New\nJersey to talk about working together and how using social media tools\ncan help all of us do our jobs.\nIt was an interesting day to say the least. I sat in a room with 45\ncops, reporters and editors who often have an adversarial relationship.\nI met cops who my reporters have been interviewing for years, as well as\ncompetitors whose bylines I knew well. It was refreshing to step out of\nthe daily grind for a few hours and talk about our shared frustrations\nand how we can do things better, particularly with the explosion of\nsocial media tools at our fingertips.\n\nAfter the jump, some of my prepared remarks, without the slight\ndiversions I took when I delivered them.\n\nWhat the public and the news media want from the police on the internet\n​1. Speed. Like news organizations and police departments everywhere, we\nhave seen our resources dwindle. At the same time, competition has grown\nexponentially. We want the information fast. We want to know what’s\nhappening before it happens and then we want to be able to alert our readers.\nIt can buy police departments time. If you get a tweet out quickly to\nalert the public or confirm or deny an event, then you can avoid calls\nfrom dozens of media outlets hounding you in the short term. It’ll give\nyou breathing room to gather the facts on the investigation before\nresponding to follow-up questions or releasing more details. We know the\nscanner chatter is often wrong, but often we can’t afford not to chase a\nstory unless the police confirm that it’s wrong.\nA tweet is a starting point. It can be a great way to immediately alert\na lot of people to a major news issue (a high-profile arrest) or a\npublic safety or infrastructure concern (tunnel closing, fire or\ntornado). But there needs to be….\n​2. Interaction. The nature of the internet has changed communication.\nIt is not a one-way platform. For it to have any relevance, you have to interact.\nPeople will come to you looking for answers. if you don’t provide them,\nlots of other people on the internet will try to fill in the gaps, often\nwith misinformation. A tweet from a passerby that says something like,\n“I drove by a fire on Main St., and it looks like a plane hit a house.\nIt’s carnage everywhere.” could have just been a small kitchen fire that\nsent lots of smoke into a residential street. There is no replacement\nfor an investigation from the authorities.\nThis will inevitably raise a number of questions in departments large\nand small: Who is in charge of the Twitter feed? Who is empowered to\npost on it? Is there a policy for replying to tweets or Facebook\ncomments? It can be time consuming to keep up to date. But a social\nmedia presence isn’t particularly useful as simply an archive of static\npress releases. (As I learned at the event, the [International\nAssociation of Chiefs of Police Center on Social Media][] has drafted a\nmodel policy for law enforcement agencies on how to adopt social\nmedia tools).\nBeing on the internet has to be faster than telling reporters that they\nhave to wait three days to talk to the designated PIO about a homicide\n(which we hear far more often than one would expect). And posting a\nsingle statement online isn’t sufficient. It’s a good place to start so\nwe know what kind of story we’re dealing with, but we need to be able to\nfollow up. We need to be able to ask questions to clarify statements and\nprobe for more detail. You don’t have to answer all of the questions,\nbut we need to be able to ask them.\nWe don’t want to ever have to attribute information to an agency’s\nwebsite or Twitter feed. We use these as planning tools. Then we want to\nconfirm the information with a real person in the department to make\nsure we got it right.\nAnd the police can use these social media platforms to their\nadvantage. The LAPD used Twitter to seek information in a hit and run of\na valet at a restaurant, for instance. They later arrested an elderly\nman in the case, although it’s not clear if the tip that led to his\narrest came from a Twitter user.\nThe NJ State Police has used Twitter to dispel rumors and bad\ninformation from scanner reports about a plane crash in South Jersey or\nSEALs training in the Delaware River. They’ve also used it to get out\ninitial information on fatal accidents and crimes before being bombarded\nby reporters.\n​3. The internet is just a tool. If your department or PIO refuses to\nshare public information with the public, then there’s no point in being\nonline. You have to have information that people want for it to be\nworthwhile. Posting about park closures or issues of minor significance\nare not good enough. Users on social media, particularly Twitter and\nFacebook are voracious news consumers. They want substance and lots of\nit. If you’re not answering phone calls from reporters who need\ninformation, there’s no reason you’d do it online.\nThe benefit of encouraging an air of transparency in your department\nhowever is that it can help demystify the process of police work and\nhumanize law enforcement officers.\n​4. Facebook and Twitter can also be investigative tools. When we\nbackground a subject of a story, a crime or otherwise, these sites are\namong the first things we look at.\nIn several cases in New Jersey lately, it’s been a key component of\ncriminal charges against young people. In the Tyler Clementi case,\nhis former roommate is charged with trying to doctor his Twitter account\nto remove incriminating information. In the case of a group of Old\nBridge teens accused of beating a man to death, they allegedly held\nextensive conversations on Facebook about the night in question and\nthe beating.\nAnd it helps us track people down, like the Hoboken woman who shot the\namazing picture of the Space Shuttle from the window of her airplane.\nWe found her on Facebook.  \n\nMy talk went well, although it was a bit disconcerting to notice that\none of my fellow panelists, Capt. Mike Parker of the Los Angeles\nCounty Sheriff’s Department, was looking up my resume on his laptop\nas I spoke. Even though I post all these things to the whole world on\nthe internet, it’s easy to forget sometimes that anyone actually looks\nat it.\nThe rest of the day’s discussions offered a good opportunity to see some\nof these sources in a less-heated environment and learn from the other\nattendees and panelists (including Ted Gest of Criminal Justice\nJournalists and Nancy Kolb of the International Association of\nChiefs of Police) about some of the resources we all have at our\nfingertips. I found out about The Crime Report, put together by\nCriminal Justice Journalists and The Center on Media, Crime and Justice.\nI also heard about IACP’s handy directory of police agencies with a\npresence on social media.\nProbably the best reminder I heard all day though came from one of the\nother panelists, Capt. Jeff Paul, public information officer for the\nMorris County Prosecutor’s Office.  He bristled at receiving calls from\nreporters asking for information, in some cases demanding answers,\nwithout ever coming to introduce themselves to him.\nEven with all of this magic from the interwebs to help us communicate\nfaster and easier, there really is no replacement for building a\npersonal relationship, face-to-face, with a police source, before you’re\non deadline in the middle of a catastrophe.\nLeave a comment below or follow me on Twitter@ultracasualand\ntell me about your experience working with police or journalists on\nsocial media networks.\n[International Association of Chiefs of Police Center on Social\n  Media]: http://www.iacpsocialmedia.org/", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2011/05/cops-and-social-media.html", 
            "title": "Hacks, Cops and the&nbsp;Internet"
        }, 
        {
            "text": "Since the Health Insurance Portability and Accountability Act’s privacy\nrule went into effect in 2003, it has become increasingly difficult for\njournalists to get information about the health care and treatment of\nindividuals. My former colleague, health reporter Betsy Querna,\nrecommends the Association of Health Care Journalists’ primer on the\nfederal law:\n\n…there are a number of public policy exceptions under the Privacy\nRule that permit the disclosure of protected health information\nwithout an individual’s authorization. For example, covered entities\nmay disclose information for treatment purposes, for certain law\nenforcement or public health oversight purposes, or in accordance with\na court order. (This list is not exhaustive.)\nAdditionally, the following are NOT protected health information:\npolice and fire incident reports, and court records. Also, birth\nrecords and autopsy records are not protected health information to\nthe extent they are maintained by state agencies. In addition, if a\nstate FOIA law designates death records and/or autopsy reports as\npublic information that must be disclosed, covered entities may\ndisclose that protected health information without an authorization.\nHospitals may maintain directories of patients, although patients can\nask to be kept out of the directory and health care professionals use\ntheir professional judgment with regard to what directory information\n(if any) to include about incapacitated individuals. When someone\ncalls and asks about a patient by name whose information is in the\ndirectory, the hospital may reveal where the patient is located in the\nhospital and information about the patient’s general condition\n(including whether the patient has died, or whether the patient has\nbeen treated and released).\nTo release additional information to a reporter, a hospital must\nobtain written authorization from the patient (or the patient’s parent\nor guardian in the case of minors). That document does not have to be\nnotarized or witnessed. The American Hospital Association’s Web\nsite, http://www.aha.org, provides a checklist of what should be\nincluded in an authorization form, along with other guidance on HIPAA.\n\nAssociation of Health Care Journalists\n\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/10/hipaa.html", 
            "title": "<span class=\"caps\">HIPAA</span>"
        }, 
        {
            "text": "Story tips short and long\n1.Write tight. Maybe the most important thing you can do to increase\nyour productivity without doing more work is to write tight and trim\nyour own work. Write briefs instead of 8 inchers. Write 8 inchers\ninstead of 10 inchers. Write 10-12s instead of 12-15s. Write 12-15s\ninstead of 15-18s. The tighter you write, the less time it takes and the\nmore time you free up for other stuff. Time is a gift to the news\nreporter. Use that extra hour or half hour to stop in on your beat, talk\nto a couple sources on the phone, read online what other newspapers are\ndoing, or skim-read documents or reports.\n​2. Prewrite/outline. Whether you sweat over your copy or it flows from\nyour fingers like hot fudge, prewriting saves you time and energy. Take\nfive to 10 minutes before you start to think how am I going to handle my\nstory. Look at your notes and materials. Make yourself a thumbnail\noutline. What’s your lede? What’s your best quote(s)? What’s the news\nimportant to readers? What’s the background? What’s the context? Once\nyou’ve got a bijou outline, you’ve got a roadmap. Drive, she said.\n​3. Demand coaching. Editors know they need to story conference and\ncoach writing and help with resources and ideas, but things get hectic\nand sometimes they don’t. That does not mean you should not ask advice\nand coaching. The crucial times to talk to an editor are: before you\nstart reporting; after you finish reporting, but before you start\nwriting; when you’ve got a top; and, of course, when you have to make a\nlate decision on whether the story holds up, reaching an alternate\nsource, etc.\n4.Master the art of the weekbook. It can’t be said too often or\nemphasized too much: the weekbook is the key to excellent and efficient\nperformance. At its basic level, the weekbook is a scheduling device. To\ntake your weekbook to a higher level of value requires the additional\ningredient: forethought. Here are several specific practices that can\nimprove your weekbook - as well as your editors’ esteem and your job satisfaction:\n\nBuild a good mix of stories every week. No one wants to do the same\n    thing day after day. Build concise dailies around news events,\n    meetings, issues. Build in patches (centerpieces) by thinking what\n    will make a good photo story. Build a weekend story every week by\n    giving yourself a couple hours early to midweek to report, a day or\n    three quarters day midweek to late week to write. Build in\n    overnights with a 2 p.m. deadline, freeing up an afternoon for\n    weekend story or enterprise work. Put in a strong daily Monday to\n    anchor the week and a timeless news feature, profile or human\n    interest story later in the week, that can be used on the weekend.\nNews stories break like waves. It’s coming (preview), it breaks\n    (hard news) and recedes (impact, folo, news feature, analysis,\n    preview of\n    next stage). Think of that wave shape. Ride the wave and you’ll get\n    three or more hits off one news event.\nAdd a line called FOLO beneath every budget line in your weekbook.\n    After you’ve finished your story, go back and give yourself leads to\n    follow up: sources not reached, questions unanswered on deadline,\n    possible profiles of people in the news, impact of an event, stories\n    that ask why? And how? instead of just who, what, where and when.\n    Readers’ surveys often indicate that one of the things readers\n    dislike is hit and miss coverage, especially one day wonders.\n    Readers want closure. They want the rest of the story. Use the FOLO\n    line to help fill your next weekbook.\nMake your weekbook a living document. Go back and change it, add to\n    it, as the week goes along. It only takes a minute. Then re-mine\n    that weekbook in subsequent weeks.\nIf you know you are going to be working on a weekend, start talking\n    to your weekend editor about your story early in the week. There’s\n    nothing more awful than a reporter in panic on Thursday afternoon\n    with no idea what to cover on Saturday or Sunday.\n\n​4. Team up with colleagues. It’s challenging, it’s fun, it’s\nproductive. And\nit gives readers from various towns some sense of how news cuts across\nmunicipal boundaries.\n​5. Keep a tickler file, aka a futures file; fill it with clips,\nletters,\nnotes, pictures, labels and related junk of every variety from which\nstory\nideas will emerge. Review it now and then.\n​6. Don’t fall into the rut of thinking there are no good stories on\nyour\nbeat. Instead, try to attack same-old stories from different,\nimaginative\nangles. Write more stories on how news impacts our towns and people.\nWrite local trend stories. Write community crime trend stories. Write\nservice pieces that inform readers about things they never thought they\nwanted to know and help readers make decisions. Write local business\npieces. Write local environmental stories. Write more people stories,\nand especially more profiles. People like to read about people. Put a\nhuman face on as many stories as you possibly can.\n​7. Remember listening posts for increasing the diversity of our\nsources and scope? Start doing them one day per period, as required. If\nyou can’t do a full day, spend a few hours one day and a few hours\nanother day. Add new sources to your regular news coverage. Add new\nvoices to the mix of sources. The Herald News should never become a\ncity/town hall newspaper!\n​8. We can do the short-term investigation. We can do investigations\nthat depend more on human intelligence than massive data analysis. We\ncan reveal sides of life in our coverage area that no one knows. Try to\nrethink your investigative ambitions. Go for the clean, short, effective\nstrike. Go for the Wow! Factor: the story that makes readers say to\nthemselves, “Wow, I didn’t know that!”\n​9. Revisit stories. Many reporters know to keep a futures file. Many\nknow to revisit certain stories on a temporal basis (after one year,\nfive\nyears, 10 years etc.). This best practice adds another revisit\ncategory: the revisit to the incomplete story. Sometimes, try as we\nmight, we simply cannot get the full story by deadline time. Typically,\nan important source is missing or evasive. Or an agency delays an\nanswer. Or a document can’t be obtained. There are many forms of this.\nWe go with what we’ve got. But when there’s a significant hole in the\narticle, we owe it to readers to revisit the story as soon as we can and\nfollow up with a second story or brief. This is especially true when the\nmissing information changes the way we covered the story previously.\nThis best practice speaks to both accuracy and thoroughness- two\nimportant parts of getting it right, which is our basic contract with readers.\n​10. Morgue. Many of you are checking the digital library for articles\ngoing back for years (to 1998) as part of your routine reporting. All\nof\nyou should be doing this every day. In addition, however, please don’t\nforget that the library has a paper morgue going back donkey years.\nIt’s a\ngood practice to check this, particularly when articles involve people\nwho\ndon’t show up in the digital. Ask Mauro Margarelli to help you find\nthe\nfiles you need.\n​11. Eight Ways to Tell a Story. One of the most useful handouts Warren\nWatson of API left behind is the one put together by the York Daily\nRecord editor about the local kid who won a dance contest. She wrote the\nsame story in eight different ways, from inverted period to Q&A, to\nphoto package, blocks, narrative and beyond. This is a handy document\nthat all should have and refer to. If you don’t have it, see Jonathan\nfor a copy. If you do have it, use it. God did not hand down the\ninverted pyramid on stone tablets. Many stories can be told better in\nother ways. Just as no one likes to eat the exact same thing three times\na day, readers, too, want variety. You can still present serious news\ninformation in entertaining ways. It just takes thought, creativity and\neffort. The reporter’s job is always to make what she finds relevant\ninteresting for the reader.\n\ncompiled from Best Practices written by Jonathan Maslow, Herald\nNews, from 2002 to 2004\n\n\nNew story forms\n1.Three Narrative Dailies.\nNarrative journalism is often associated, in journalists’ minds, with\nlengthy enterprise projects. But there is no law saying narrative\ntechniques cannot be used in dailies or short form. At the recent\nNiemann Narrative Conference at Harvard, I jotted down three types of\ndaily stories that we could start doing to tell stories in new,\ninteresting and insightful ways for HN readers. Below, three generic\nbudget lines. Use them in good health, with one caveat: narrative\ndoesn’t mean you can make it up.\nTICKTOCK\nWe take a news event, breaking or second day reporting. Instead of\norganizing from the most important in the lead to the least important\nat the end, we reconstruct the event over time. What led up to that\nexplosion? What happened the night that cop was murdered? What did that\nfamily do on the day they died in a car crash? Exactly what steps did\nthe mayor take that allowed him to pass a zero increase budget? Or,\nalternatively, what is the aftermath of a particular news event? What\nhappened minute by minute after the plane crashed? What happened to the\nfreeholder in the days and weeks after he dropped out of third grade?\nSECONDDRAFT\nJournalism is often called the first draft of history. But the first\ndraft\nis often abbreviated and cursory, sometimes underreported or skewed,\nand in some cases, wrong. In this story type, we take a second look at a\nbreaking story, going back to sources for a fuller or better account,\ntaking an unexpected angle or digging out some universal human truth\nfrom what at first ran as a brief or rushed deadline piece. The goal is\ntruth, not just facts.\nEXPLAINER\nNarrative methods focusing on one person can often help readers\nunderstand complex, novel or unfamiliar issues and processes better than\nconventional reporting - which often overlooks the explanatory.\nBankruptcy. Identity theft. Outsourcing. Uninsured. Poverty level.\nDaycare. Drug addiction. Productivity. Deregulation. Bond rating. And on\nand on. In the explainer, we use one person’s story to give readers\ninsight into a hard-to-get-at topic.\n​2. Three types of profiles.\nWe tend to think of profiles, if we think of them at all, as one thing:\nstories about people. It took Bill Blundell, former Page One editor at\nthe\nWall Street Journal has three types of profiles:\n​a. The General Profile: Concentrates on unique qualities of subject,\naspects of difference: what makes this person unique, different,\noutstanding, unusual, unconventional, nontraditional, nonstandard,\npeculiar, pale and interesting?\n​b. The Microcosm Profile: centers on aspects of sameness,\nuniversality.\nIn what ways is this person or this person’s story typical, universal,\nhuman, like all of us? What part of her or her story can we all\nconnect with?\n​c. The News Profile: centers on the subject’s connection to a news\nevent. Also could be called, as the Times does (or used to): Man in\nthe\nNews. Person in the News?\n\nJonathan Maslow, June 2004\n\n\nThe Enterprise project\nIn our conference call with Cleveland Plain Dealer writer Connie\nSchultz, she mentioned several methods that helped her narrative series\n“The Burden of Innocence,” which was the subject of our brown bag\nwriters group. They are excellent practices, not only for narrative\njournalism, but for any enterprise story.\n​1) Write as you go.\nSchultz said she always transcribed her notes as soon as possible and\nkept them in files organized by month as she worked on the series over\nthe course of one year. Any project that involves reporting over time\nbenefits from having well-organized notes from interviews and reporting.\nIt puts the writer ahead of the curve when you get down to the business\nof writing. This practice can be easily extended to the practice of\nwriting\nthemes, sections, scenes, dialogue, good quotes, etc. as you go. Don’t\nimagine you can wait until you’re reporting is done, then look back at\nyour notebooks or journal and suddenly pull the white rabbit out of the\nhat. Doesn’t work like that.\n​2) Writing a Map/ outline.\nSchultz said that before she started to write, her editor asked for a\nwritten map, a term she described as having less onerous associations\nthan outline. The map or outline provides writer and editor with a guide\nto the story, where it starts, where it goes, what it’s about, where it\nends. It makes the writer think. It need not be followed like a\ncontract. Whatever it’s called, this best practice is one of the\nquintessential building blocks of longer-length writing. Without it, you\nare, effectively, roaming around blindfolded, hoping to pin the tail on\nthe donkey. With a roadmap or outline, even if rudimentary (many are the\noutlines noted on the back of a cocktail napkin; Tolstoy outlined Anna\nKarenina on a railroad train dining car menu (which, however, later fell\nbehind the sofa at his estate Yasnaya Polyana, forcing him to write War\n& Peace first instead, but that is another story)).you can focus on the\nmaterial and how to express it accurately, faily and gracefully, not on\nwhat to write next.\n​3) Rewriting.\nSchultz said rewriting was the most painful part— she went through a\ndozen major drafts. But rewriting is an absolutely necessary practice to\nachieve successful narratives/enterprise stories. If you are to become a\nskilled pro writer, you must get past the idea that rewriting means you\nare doing something wrong. Rewriting is, in fact, doing something right:\nImproving the story, draft by draft. No story has ever suffered from\nrewriting. Many suffered from too little rewriting. Just as the\nmap/outline helps the writer through the first draft, the editor’s read\nand conferencing helps the writer through rewrite. Talk out what needs\nto be done. Partner. Writers don’t need to accept everything an editor\nsays, like medicine or punishment. Writers do need to defend and\narticulate something they want to keep. Develop a collaborative rewrite\nstrategy and get to it.\n​4) Writing buddies.\nScultz said she chooses another writer in the newsroom she respects to\ncritique her pieces, so that she has an additional sounding board\noutside the editors-reporter loop. Practically every mature writer does\nthis, asking colleagues or friends to read the work and tell the brutal\ntruth. However, this practice really depends on choosing someone with\ngood judgment, analytical skill and the ability to articulate and\ncriticize> constructively. Anything less is less than helpful.\n\nJonathan Maslow, April 2003\n\n\nEdit Proof copy\n​1. The reporter’s constant focus should be on the question: what is\nthis story about? That helps shape the lede, the angle, the structure,\neverything. Also, editors should keep reporters focused on this question\nthroughout the day so that the reporter refines and hones the story to\npresent the reader with a tight, concise, well-organized story without\nholes, digressions or frills.\n​2. There’s a natural contradiction between the creative process and\ncritical thinking, between writer or storyteller inside us and the\neditor or\ncritic inside. The critic suppresses the storyteller and makes it\nharder for\nthe storyteller to tell the story. That’s why it’s so hard to write a\nsolid\nlede: every time the storyteller wants to put a thought down, the\ncritic\nsays ,”that stinks,” “that’s not good enough.” So Chip Scanlon talked\nabout “lowering your standards” when you draft your story. I think a\nbetter way to say this is to suspend your critical faculties while you\nare writing your first draft and just get it down using your creative\njuices. Then switch over to your critical faculties to rewrite, sharpen,\ntrim, etc.\n​3. A topic is not a story. You can’t write about AIDS, or mass\ntransit, or affordable housing. Those are topics. A story has to have a\nbeginning, middle and end. It has to have characters. It has to have a\nplot.\nIt has to have a setting. This is a cogent point. How many times do\neditors hear from reporters, “I want to write about poverty in\nPaterson.” “I want to write about the Passaic River.” “I want to write\nabout race relations between latinos and blacks.” How many times do\nreporters hear from editors: “We should do a story about high property\ntaxes.” Well what about it? Themes are not stories. Think about telling\nstories. It’s elemental.\n​4. Words of wisdom from Don Murray, a legendary writing coach, on\norganizing and “mapping” the reporting and writing of a story:\nexplore, focus, rehearse, draft, clarify.\n​5. Experienced reporters know what is the least amount of reporting\nthey need to do for any given story. Great reporters know there is no\nlimit\nexcept deadline for reporting, and that the quality of a story really,\ntruly\ndepends on the reporting, not the writing. If you don’t know as many\nfacts\nand factoids as you possibly can, the story is going to be thin and\npale.\nSomebody said, “Reporting is taking a beer keg information and\nsqueezing it into a perfume bottle.\n​6. A good way to start the process: reporter and editor brainstorm\non reader’s questions. What does the reader need to and want to know\nabout the story. That helps the reporter focuse on question above: What\nis this story about?\n​7. Rick Bragg’s five boxes. NY Times reporter Rick Bragg learned\nfrom a mentor that he should organize and write his stories as if he\nhad\nfive empty boxes floating in the air above him: In the first box, he\nput the\nlede or grabber. In the second, the nut graf: what’s this story about.\nIn\nthe third box, tell the story. In the fourth, info, context, back\nstory,\netc. And in the fifth, the kicker, the ending, something that leaves\nthe\nreader with emotional meaning.\n​8. Jack Hart, enterprise editor at The Oregonian: Don’t confuse\nanecdotes in anecdotal ledes with scenesetters. Anecdotes are little\nstories, with their own beginning and end. Scenesetters just get the\nreader to the right “place.”\n​9. Get rid of dependent clauses in your sentences.\n​10. To revise, you need to achieve distance. You can’t plunge right\ninto a revision. You have to take a break, do something else for a\nwhile, eat something or drink something, divert your attention, go for a\nwalk, something. Everyone finds their own way to get a distance on\nhis/her own work. Whatever cools the engine down then revs it up again.\n\nJonathan Maslow, May 2005\n\n\nStory conception and execution\n\nFrom notes taken during Jacqui Banaszynski’s visit to the Herald\nNews on Aug. 14, 2004.\n\nWe have to tell people what the news means and what’s its significance.\nWhen you get a story assignment, immediately sit down and brainstorm for\nfive minutes.\nBrainstorm questions, not even to necessarily use in an interview.\nAnything you think you know, turn it into a question.\nAsk yourself:\n\nWhat do you want to know?\nWhat are you curious about?\nWho are the stakeholders in the story?\n\nAt the end of the day, do this again so you have ideas for second day stories.\nOn most stories, you write the first-day story. On the second day, you\ndo a story that’s very wide, takes in all the questions but is not very deep.\nInstead, do six or seven deep stories of varying types:\n\nProfiles - character-based\nIssues/trends - ideas, fashion\nInvestigative - records-based\nExplanatory - a teachable moment\nDescriptive/voices - use telling details\nNarratives - scenes & dialogue\nVisuals - using graphics and boxes to tell the story\n\nEditors want a working nut graf when you pitch a story. Do some\npreliminary reporting.\nEach editor is looking for something different, get to know each of them.\nWriting a budget line helps you establish goals. Write your working\nbudget line as questions.\nFind a colleague who will read your ledes in progress and to discuss\nstory craft with.\nLedes engage the reader. Don’t misdirect the reader. Lede them with\nforeshadowing and summarize.\nUnlike the AP, don’t frontload a lot of information.\nThe lede should signal the tone and voice of the story.\nVary the pacing and rhythm and length of your sentences. Long sentences\nread fast. Then a short sentance halts the reader.\n\n30 Tips from Poynter’s Roy Peter Clark\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/10/story.html", 
            "title": "Story&nbsp;development"
        }, 
        {
            "text": "Tipsheets\n\n10 databases for covering City Hall\nInvestigating local gov’t\nLooking at local contracts\n\nThe way to keep your politicians honest, or even better to prove when\nthey’re being dishonest, is to have the right paper (and electronic)\ndocuments. As you approach your beat, and learn it inside and out, try\nto compile as many of these documents and statistics as you can. Keep\nthem on hand. They will prove to be immensely useful countless times in\nthe future.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/10/docs.html", 
            "title": "Documents every gov&#8217;t reporter&nbsp;needs"
        }, 
        {
            "text": "Tipsheets\n\nGuide to NJ budgets\nBudget primer\nGreat worksheet\nSpreadsheet version\n[Rutgers’ intro to budgeting ][]\n[More tips from Claude ][]\n[20 more tips from IRE ][]\n\nThese notes were compiled from discussions with The Record’s Passaic\nCounty bureau editor Claude Deltieure. He is incredibly knowledgeable\nabout local and school budgets in New Jersey and has been very generous\nwith his time.\n\nBudgets are made up of two main sections, revenues (income) and\nappropriations (spending). In an ideal world, these two would match up.\n\n\nRevenues\\                                            Appropriations\n  Property taxes\\                                          Current expenses (salaries and other expenses)\n  State & Federal aid (fluctuates and may not come)\\       Capital outlay (big ticket repairs)\n  Miscellaneous revenues (fees, licenses, court costs)\\    Debt service (payment on municipal loans)\n   Surplus (carried over from last year)                   \n\nAs Claude is fond of saying, municipal financing New Jersey is “built\nfor idiots.” You have to “appropriate” the public dollar to use it for a\nspecific purpose. The governing body must vote to do this to pay any and\nall bills. Capital outlay is defined as durable goods that last more\nthan three years.\nYour job, as a reporter, is to give readers an idea of how their taxes\nare going to go up and explain why.\nThe total property tax bill is made up of several components:\nmunicipal services\nschools\ncounty\nopen space tax\nregional district tax\nfire\ngarbage\nLength of service annuity program\nThe Length of Service annuity is meant to help support volunteer\nfirefighters and ambulance corps. Each town will pay for a volunteer’s\nequipment, and this money must cover that. One-penny on the tax rate\ngoes to the annuities to be paid to a volunteer upon retirement.\nNew Jersey also ran out of landfill space 20 years ago, so it must pay\nastronomical amounts to handle its garbage.\nRegional districts are shared and provide rural schools that cover\nseveral towns. The towns that “send” their students to school in another\ntown must pay for those services.\nYou have to tell your readers that the municipal services tax is going\nup, not just that taxes as a whole are rising.\nThe state overseer of all issues regarding local finance is the\nDivision of Local Government Services under the Department of\nCommunity Affairs. In many ways, it functions like a state version of\nthe GAO.\nThe LGS reviews every municipal budget and must approve it.\nThe council does not “pass” a budget. It first “introduces” it to the\ntown’s residents. Once the council introduces a budget, you as a\nreporter must be allowed to get a copy. They cannot give you a summary\nversion. The council will then go on to “adopt” the budget. A governing\nbody in New Jersey must have a two-thirds majority to pass a spending matter.\nThe impact in dollars and sense\nThe amount of your property taxes is based on the value of one-penny per\n\\$100 of the taxable value of your property. Each town hires an\nindependent assessment firm every few years to perform a “revaluation”\nof its properties. On that, it bases its property tax assessments.\nThe tax rate is based on how much money your town collected last year.\nIf you only collected 95 percent of the taxes last year, you can collect\n105 percent this year.\nThat extra 5 percent, if you can collect it, is set aside as a “reserve\nfor uncollected taxes”. If this year you collect 98 percent of your\ntaxes, that extra 2 percent goes into your surplus and reserve. The\nreserve is anything you didn’t spend last year.\nThe surplus in the current budget comes out of last year’s reserve.\nTowns will often underestimate their expected tax collection rate, or\noverestimate their appropriations so that at the end of the fiscal year,\nthey will have money left over to build their surplus. A surplus should\nbe between 3 and 5 percent of the total budget. You need to be able to\ncommunicate to your readers this pull-and-tug of making the revenues and\nappropriations match up.\nYou need to know how many tax dollars come into your town if you collect\none penny per \\$100 of assessed valuation.\nFirst, call your town’s tax assessor and ask for the total valuation of\nyour town. You can also find it on the LGS’ Web site here. If the\ntotal value of your town is \\$3 billion, one tax point will raise\n\\$300,000. So for every \\$300,000 in spending the city plans, it will\nlevy one point in taxes.\nTo apply that to the average reader, multiply the tax-point times the\naverage assessed value of a property in your town. Again, you can find\nthis out from your tax assessor (who really should become your best\nfriend), or from the LGS.\nSo if the average property in your town is worth \\$100,000, and your\ncouncil wants to buy a \\$1.2 million jet for the mayor, how much will\nthat cost your average taxpayer?\nTo find the average tax rate for each person: Divide \\$100,000 by \\$100\nand then by 100 pennies. That gives you \\$10. So for each tax point that\nthe town raises its taxes, the average homeowner will pay \\$10 more. If\nthe municipality pays for the entire \\$1.2 million jet, that will cost 4\ntax points (\\$1.2 million divided by \\$300,000 per tax point). That will\ncost your average taxpayer \\$40 more each year (4 tax points times \\$10\nper point for the average home).\nFiguring this out can help you paint spending decisions in a way readers\ncan grasp. You should have these base figures—the total valuation, the\ntax point and the average value of a home—handy for each of your towns.\nSchool districts also receive state aid based on a formula. The state\nexpects each district to pay \\$10,000 each year to educate each student.\nThe state looks at the average income and property values of each town\nto see how much it can afford of that \\$10,000 per student. If it\ndoesn’t have the money, the state will pay for the essentials. But arts\nand other programs, such as music, can not receive this “state\nequalization aid” from Trenton.\nThese budgets can be very confusing, but as a reporter, you need to\nlearn as much as you can about how they work. You must be able to talk\nshop with elected officials about the budgets to be able to detect\nattempts at slipping items through without the public’s notice.\n\nBy Tom\nWhen we’re writing budget stories, local officials often omit key\nnumbers that every reader wants to know. To help ensure that you don’t\nforget to press them to fill in the blanks, here’s a handy checklist of\nthe key figures you need to ask for. Every budget story must include\nthis graf:\n\n\nUnder the adopted (proposed) 2010 budget, the owner of a home\nassessed at the borough average of \\$65,000 will pay \\$2,395 in\nmunicipal (school/county) taxes, a rise of \\$99.70 from last year or\n4.4 percent.\n\nRemember:\n1. The fiscal year\n2. The average home assessment\n3. The total amount of that average municipal/school/county tax bill\n4. The total dollar increase in the average tax bill\n5. The percent increase in the average tax bill\n[Rutgers’ intro to budgeting\n ]: /files/tips/rutgers.pdf\n  [More tips from Claude\n ]: /files/tips/budtips.pdf\n  [20 more tips from IRE\n ]: /files/tips/20budtips.doc", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/09/budgets.html", 
            "title": "Budgets"
        }, 
        {
            "text": "The accuracy checklist is intended primarily for beginning reporters on\ndaily stories, but its reminders can be useful for journalists of all\nexperience levels.\n- Jaci Smith, Herald News, Jan. 2007\n\nA printable checklist\n\n\nSlug:\n\nReporter:\n______ All names verified in common sources (phone books, voter\nregistration, Internet, etc.) and double-checked for spelling, titles,\naddresses and CQ’d\n______ Numbers double-checked and CQ’d; math double-checked by\ncalculation and CQ’d\n______ All phone numbers double checked by dialing and CQ’d; Web\naddresses double-checked by browser and CQ’d\n______ All quotes double-checked from notes; uncertain quotes read\nback to source for verification\n_____ All information gathered from common sources (e.g. Internet)\nverified with human sources\n______ All quotes verified with editor for accuracy of meaning and\ncontext, and non distortion\n______ Transparency: reader informed to greatest extent possible\nhow we got facts?\n______ Fair comment rule followed\n______ Disclaimer (not reaching sources) accurately and thoroughly described\n______ Unclear phrases removed in rewrite and editing\n______ Story vetted for potential libel\n______ Nothing based on memory\n______ If you are not certain about accuracy, did you ask editor\nto hold story?\n______ Will you be available by phone for Copy Desk questions? If\nnot, tell editor when you will be available", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/09/accuracy.html", 
            "title": "Accuracy&nbsp;checklist"
        }, 
        {
            "text": "After yesterday’s discussion, some might ask the obvious question:\naren’t there already people doing this?\nI don’t intend to denigrate the years of service by so many passionate\nand intelligent fans. I wish they could have been compensated even a\nfraction for the sweat they’ve poured into writing about the game.\nAnd with varying degrees of success, some organizations are attempting\nwhat I propose, to support legions of writers with the values and\nresources of their ancestors in newsprint. There’s a battalion, at\nleast, of podcasters. There are networks of soccer scribes\nlike American-Soccer-News.com. And then there’s MLSsoccer.com.\nThere has been a little debate about whether fans should consider\nMLSsoccer.com to be a legitimate and credible news outlet. Forget for a\nmoment that no other major organizations provide comprehensive reporting\non the domestic leagues (even though one would expect that ESPN or\nFox Soccer would want to mount such an effort) and that MLS is\nsimply stepping into the breach to give fans what they want.  With the\nsweeping inhouse relaunch of the site this season, the league and its\nemployees clearly plan to “cover” the sport, both here and abroad. But\nshould they, and if not, what role should the league’s official website play?\n\n\n  Photo by Diego Radzinschi\n\n\nWe need to remind ourselves that MLSsoccer.com is the public relations\narm of a major corporation. Many fans would agree that we really can’t\ntrust the site to give us honest, straightforward reportage on issues\nthat are less than flattering to the league as a whole. As other writers\n(including [one at the U.S. Mens National Team Players Association’s\nofficial website][]) have observed, it’s like watching a snake eat its\nown tail when you try to get information from an official mouthpiece\nthat also attempts to cover the news. You don’t rely on the Federal\nReserve for unbiased, critical and important writing about U.S. monetary\npolicy. You don’t need to do it with your favorite sport either.\nMLSsoccer.com ought to be a repository of fast, easy-to-find video and\n(I credit this concept entirely to FakeSigi) openly accessible\nstatistical data. The site should create a public API to allow fans to\nuse the league’s entire database of historical game and player\nstatistics. One can imagine how a blog like Climbing the Ladder,\nwhich I believe does its analysis with its own cobbled-together data,\ncould be even cooler if it had the actual league stats to tinker with.\nAlthough MLSsoccer.com is keeping more than a few people gainfully\nemployed, I want to see more organizations spring up so that so many\nwriters aren’t directly dependent on the league to make a living. We\nneed to find ways to support good, young soccer writers so they can\nwork, report and get better at their craft without having to shill for MLS.\nUnravel the conflicting interests\nOutside MLSsoccer.com, much of the writing on the U.S. game resembles\nthe pamphleteering of the early Republic. Lots of Whigs and Federalists\nwrite blogs for like-minded folks, but their own biases can make them\nhard to take seriously.\nAlthough some good coverage of the sport comes from partisans, I don’t\nwant the writer on whom I rely to be staked in the camp of any one team.\nThere shouldn’t be any fans in the press box. Stories and podcasts about\ngames shouldn’t include the word “we.” Soccer fans are incredibly\npassionate, and they go to great lengths to identify with their teams.\nBut I want knowledgeable, independent writers, free of the auspices of\nthe league and its card-carrying supporters clubs.\nTo this end, I’d like to see American soccer writers, professional and\namateur, adopt the ethical guidelines of the Associated Press Sports\nEditors. As an organization, the North American Soccer Reporters\nshould publicly lean on its members, particularly those not affiliated\nwith news agencies with their own ethics policies, to subscribe to this\ncode. It reads, in part:\n\nEditors and reporters should avoid taking part in outside activities\nor employment that might create conflict of interest or even\nappearance of a conflict.\n\nThey should not serve as an official scorer at baseball games.\nThey should not write for team or league media guides or other\n    team or league publications. This has the potential of\n    compromising a reporter’s disinterested observations.\n\n\nAs fans, we pay to support soccer in this country, whether in satellite\npackages or scarves. If for no other reason than we want to make sure\nthat our money is well spent, we should expect the people who deliver\nthe news to be minding the bank rather than boosting their club. The\nonly hitch: we may have to pay more to get what we deserve.\nNo more free transfers\nAt the very least, we need more neutral, unaffiliated writers who embody\nthe traditional values of newspaper journalism. In an ideal world, that\nwould come with a major investment to create a news organization that\ncould do justice to soccer’s huge potential in this country.\nSo far, there have been a handful of single proprietors who have been\nsuccessful at making a living on the internet as soccer hacks, most\nnotably my former Herald News colleague Ives Galarcep. But I’m\nproposing an online publication that would require the footprint and\nresources of a larger organization to make it work.\nThere are several—largely untested—business models that, with the\nright editorial direction and an angel investor or two, could produce\nsoccer news worth paying for. Not everything needs to be locked behind a\npay wall. Until relatively recently, Soccer America did just that, a\nprint-focused decision that could be argued largely blunted its\ninfluence as the demand for soccer news on the web exploded. I’m not\nadvocating for any particular model, whether its based on subscriptions,\nsyndication, micropayments or the like. But readers need to understand\nthat you can really only get the stories you want when a publication can\npay for the work it takes to dig them up.\nEarly in my career, I wrote about the Kansas City Wizards for Cyber\nSoccer Associates, a group that still exists and now maintains the\nAmerican Soccer News site. For two seasons,\nI followed the team, writing game previews and match reports. I hesitate\nto say I “covered” the Wizards. As a part-time writer, I didn’t have the\ntime to attend training sessions, and I really had no idea what I was\ndoing. I didn’t develop stories or break news. I mostly reacted and\ntranscribed game events. It was a great gig, but in retrospect I see the\nmissed opportunities to go deeper. The model of American Soccer News,\nand I believe The Offside as well, is to create a network of\nvolunteer writers dedicated to individual teams and link them all under\none banner. It’s a great idea, but it falls short in a couple of key\naspects: it’s a part-time gig at best, and there’s a tendency for the\nwriters to be advocates for the teams rather than probing journalists.\nThis all leads me once more to a key question, as Richard Whittall\nhas asked time and again:\n\nDon’t most soccer bloggers secretly consider a career writing for a\nmajor news organization with all its resources, access, accreditation\nand living-ish wages, the ultimate endgame for their online endeavours?\n…Is this after all just a fun little hobby? And if not, what are we\nall going to do about it? Are traditional pay-for-content models\nreally and truly dead?\n\nThe newspaper industry has largely ignored soccer, but the values of the\ndaily print journalist are hard to beat. And the truly good newspaper\nreporter is impossible to replace for free. With all the writers\nslogging away at this subject, we have the raw talent. We have the\nknowledge. We have a market for the news. The soccer fan should be an\nadvertiser’s dream demographic. We need the business acumen that can\nmonetize the news so that writers can make the jump from dedicated and\nsometimes gifted amateurs to professional reporters, with all the\naccountability and responsibility that entails.\nThere are two things on which American soccer fans can generally agree.\nWe want thriving, world-class domestic leagues, for both men and women,\nand we want the men’s national team to win the World Cup. At this point,\nwe’re decades, if not generations away from realizing those dreams. But\nwe can get there by taking one step at a time, and the most important\nstep is to keep the sport alive here long enough for it to happen.\nA vigorous press, despite its shortcomings, has always been vital for a\nstrong democracy. For soccer to continue to grow in America, we need a\nstronger, independent press. To do it right, to have professional\nreporters competing to break stories in every city with a team, it will\ncost money. For soccer fans and other interested readers, it may be end\nup being cheap, but it won’t be free. At the end of the day, for the\nsport we all love, it will be a small price to pay.\nLeave a comment below or follow me on Twitter@ultracasualand\ntell me what you think.\n[one at the U.S. Mens National Team Players Association’s official\n  website]: http://www.ussoccerplayers.com/ussoccerplayers/2010/04/mlssoccers-competitive-balance.html", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/05/whos-minding-the-goal.html", 
            "title": "Who&#8217;s minding the&nbsp;goal?"
        }, 
        {
            "text": "As anyone who’s stumbled upon my Twitter feed can tell you, I’m a\nsoccer fan whose zeal for the sport approaches fanaticism. But over the\nlast 15 years, I’ve driven myself crazy trying to find news about the\nprofessional game in all its domestic incarnations, whether it be Major\nLeague Soccer, Women’s Professional Soccer or one of the lower\ndivisions.\nI make my living editing local news—town councils, zoning boards,\nschool boards—for a daily newspaper. It’s been doubly frustrating for\nme then that a large majority of my colleagues in the media consider\nsoccer to be a third-class sport.\nBy and large, soccer is ignored or, at best, squirreled away among the\nagate results, somewhere behind junior high water polo. Much has been\nwritten in the blogosphere about how soccer is a sport tailor-made for\nthe internet. With the advent over the past couple of years of\nprevalent, cheap and quick streaming video, anyone can now watch live\ngames from around the world. You don’t need broadcasters to watch the\ngame. And you don’t need your major metropolitan daily newspaper to read\nabout it.\nFrustrated by the willful ignorance of newspapers and TV, soccer fans\nlike me have created their own media. Blogs, webzines, podcasts and\nother online publications have proliferated, sustained by fans who\nweren’t getting the news and analysis they wanted. In many ways,\nAmerican fans have provided a perfect example of the “citizen\njournalism” movement that Jeff Jarvis has been preaching about all\nthese years.\nIt’s been great to see the level of engagement by so many regular fans,\nbut I still find myself yearning for more. I want deeper reporting,\nbetter writing and smarter analysis. I want it all packaged in an\nattractive design, and I want more of it every day. I daydream about a\nsoccer publication that embodies some of the best values of newspaper\njournalism infused with all the potential of the digital realm.\n\n\n  The press box at Red Bull Arena at halftime during the March 27 game against the Chicago Fire.\n\n\nA familiar refrain\nMany of the better critics and writers in the soccer blogosphere have\ntackled this subject before. I’m certainly not alone. A More Splendid\nLife, Pitch Invasion, This is American Soccer and others far\nmore clever and thoughtful than me have bemoaned the same problem. A lot\nof readers want better coverage of the sport, on both the professional\nand amateur levels. But there are so few opportunities to make a living\nat soccer writing, it’s difficult to expect anyone to answer the\nSiren call as anything more than a hobby.\nThe problem begins with the big mainstream purveyors of sports\njournalism, the newspapers and magazines that have traditionally funded\nserious and ongoing reporting. They won’t, for the most part, touch\nsoccer. Sure, we’ll see a few features between now and July 11, but\nthat’s about it. At many publications, if they even have a soccer\nwriter, he or she is pretty far down in the newsroom pecking order.\nThey’re lucky if their stories get any kind of play on the cover of the\nsports section at all.\nFine. We’ve spent the better part of two decades whining about this.\nSoccer speaks for itself. The market for the game is growing and will\ncontinue to expand for some time to come. As Richard Whittall\ncorrectly observes:\n\nAnd as large, ungainly media outlets are forced to cut costs and\nbroaden content, in-depth sports journalism will be left to a sea of\nindependent, often fan-biased bloggers working with their own\nresources. Many club supporters will be smarter, more connected, and\nmore knowledgeable as information about club and league power\nstructures are exposed to an increasingly-global fan base.\n\nThe vibrant and growing community of writers that has evolved online has\nbeen a great (if only partial) antidote. In some ways, this grassroots\njournalism resembles the punk rock and Jamaican music scenes of the ‘60s\nand ‘70s. If you don’t find what you want, do it yourself. This attitude\nhas served soccer well at a time when the internet enables anyone with\nthe chutzpah to pretend to be an expert and the free time to devote to\nit to become a soccer pundit with hundreds, if not thousands of\nfollowers. The laptop and Wordpress are the three chords of the internet\nrevolution. Anyone can do it, and when the “professionals” won’t, anyone will.\nThe super subs\nAs I researched this piece, I kept finding (or being reminded of) more\nand more examples of very nice work being done by amateurs, bloggers and\nprofessionals alike.\nThere’s The Run of Play, whose ether binge cultural criticism is\nnothing if not fascinating (not to mention its design, which is truly\nunique in this genre). There’s the pseudonymous Fake Sigi (a Fake Steve\nJobs aimed at those who follow one of Major League Soccer’s most\nsuccessful and rotund coaches, Sigi Schmid), whose scathing dissection\nand analysis of the league-run mouthpiece, MLSsoccer.com, has been a\nreal revelation in recent months.\nThen there’s the fan-oriented networks of bloggers and podcasters who\nspend countless hours watching, breaking down and reviewing matches.\nMany of them conduct interviews with players, coaches and officials as\nwell as journalists and fellow fans. Seeing Red, a relatively new\npodcast covering the New York Red Bulls, has been a valuable addition\nthis season to the coverage of the team from the fan’s seats.\n(In the spirit of full disclosure, over the past six years, I have\nedited a pair of soccer blogs, on my own and for my former newspaper.\nThose experiences, and their unceremonious ends, give me even more\nrespect for those who continue to slog away at the daily grind of blogging.)\nAdd to these the traditional newspaper and magazine journalists who have\ntaken to the web and social networks to hone their brand and solidify\ntheir command of the beat: Ives Galarcep, Steve Goff, Grant\nWahl, Jack Bell and so on.\nThere’s a lot to like. Still, we can and should all expect a lot more.\nUnderstandably, some bloggers and amateur reporters can adopt a\ndefensive posture on the subject of professionalism. It’s not unique to\nsoccer writing, and it’s certainly not unique to America. Although the\nissues are somewhat different in England, Lukey Moore, one of the\nfanatics behind the hilarious, exceptional and smart Football Ramble\npodcast, elucidated this view in a recent interview:\n\nThere is a bit of a backlash in the media these days against things\nlike amateur blogs and podcasts, a lot of journalists think that the\ngeneral public’s opinions are not as valid because they are not\n‘proper journalists’. Doesn’t really bother me though, I can count on\none hand the number of football journalists I actually respect.\n\nThere’s no argument that professional caliber journalists don’t hold a\nmonopoly on opinions or incisive commentary. But in one important\nregard, they can’t be beat. Few others have the time, patience or\nability to build relationships with sources in the game that can unlock\ndifficult stories. That kind of deep reporting can grant them the\nauthority to ask the unpopular questions that the powers-that-be would\nrather ignore.\nThe need for game-changers\nIn my little free time, I want to read something about soccer in North\nAmerica that: a) I didn’t know already, b) casts a critical eye on the\nsport, and c) comes from someone who is a skeptical spectator,\ndisinterested in the outcome of any particular game.\nThere are a few dozen solid reporters on the beat in this country, as\nthe roster of the North American Soccer Reporters will attest. But\nthere aren’t nearly enough.\nNew York Times executive editor Bill Keller’s recent reviewof a\nbiography of Henry Luce captured a bit of my quandary.\n\n…a significant population of serious people feel the need for\nsomeone with training, experience and standards — reporters and\neditors — to help them dig up and sort through the news, identify\nwhat’s important and make sense of it. That in no way precludes\nenlisting the audience as commentators, as contributors and as\ncollaborators. (Witness the splendid hybrid of professional and\namateur journalism that has kept alive the stream of news from Iran.)\n\nSome days, it seems that 99 percent of soccer “news” could be classified\nas either game transcripts or outright boosterism. I read quite a\nbit of it, but I also want the news that you can really only get by\nchasing it full time, building relationships with players, front office\nstaff, owners, league employees, coaches and referees over the years.\nIn the jargon of my industry, I want more of the old media’s values in\nthis new media sport: Accountability, speed, skepticism, fearless\nquestioning of authority. Get it fast and get it right, and when you\ndon’t get it right, own up to your mistake and correct it. Without these\nkind of mores suffused into our writers, I worry that far too many\nimportant stories are crying out for more reporting. What happened to\nCharlie Davies on the night of his accident? What is going on with\nShalrie Joseph’s life and career? What kind of negotiations went\ninto crafting Major League Soccer’s latest labor agreement?\nSometimes it seems there’s a disconnect between soccer writing and news\njournalism. I go to work every day and ask questions of people in power\nbecause I act as a proxy for the regular, taxpaying resident. There is a\npresumption that government should be open and accountable. Regardless\nof how much we couch it in terms of passion, culture and tradition,\nsoccer is a business. It’s becoming a very lucrative business, and it’s\nvery closely held. It’s a private enterprise, and thus there isn’t that\nsame moral authority to ask questions and demand answers. But still,\nreporters should be using their access, knowledge and insight on behalf\nof the average fan.\nSomeone needs to ask probing questions. We need reporters to help hold\nmanagers and clubs responsible for their mistakes, whether they be poor\ntactical decisions at a US Open Cup match or the financial mismanagement\nof an entire club (See: Portsmouth, Leeds, Crystal Palace, Chester City,\nLA Sol, Miami Fusion, etc). We’re being sold a product, whether it’s\nseason tickets or jerseys or television advertising. If we’re going to\ninvest our money (not to mention time and energy), it should be worth\nour investment.\n\n[Marie Hardin][], a professor at Penn State’s [John Curley Center for\nSports Journalism][], [wrote a piece][] in 2007 arguing for a stronger\nethical grounding for sports reporters:\n\n\n\nOne has to wonder what other stories in the public interest (about\nsystematic problems and corruption in sports, including those at the\nprep level) may have also gone unwritten. Although perceived as fun\nand games, sports at almost every level in the United States have\nbecome big business with consequences beyond the playing fields.\nSports journalists have an ethical obligation to provide citizens and\nconsumers with fair and balanced reporting on issues that affect their\ncommunities, their pocketbooks and the health and educations of their children.\n\nHere in America, we need more reporters walking the soccer beat day in\nand day out, particularly in towns that aren’t so sexy. We need more\npeople in Kansas City, St. Louis, Salt Lake City and Dallas, for\nexample. We need more people asking tough questions and competing with\nthe writers already out there. A competitor breathing down your neck\nreally helps you kick it into gear and get a better story.\nBefore we get more writers (which I’ll discuss in a second part\ntomorrow), we need to add the values of professional journalism to the\nhealthy and established internet community of writers. I’m not\nadvocating for a new alliance of bloggers, each sitting in his own\napartment and riffing, linking back and forth. I’m talking about a\nserious, concerted effort to groom, deploy and support soccer writers.\nTomorrow, I’ll discuss how the writers we have can get better and what\nwe’ll need to do to get more of them.\nLeave a comment below or follow me on Twitter@ultracasualand\ntell me what you think.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/05/no-cheering-in-the-press-box.html", 
            "title": "No cheering in the press&nbsp;box"
        }, 
        {
            "text": "A few months ago, I was laid up for a few days recovering from knee\nsurgery. I spent most of the time lounging on the sofa and watching\nEuropean soccer games on ESPN3.com. But I also stumbled upon a great\nseries of podcasts that walked me through how and why journalists\nshould bushwhack into the social media frontier.\nThe programs, essentially a series of lo-fi internet radio call-in\nshows, were hosted by Sree Sreenivasan, dean of student affairs at\nColumbia University’s Graduate School of Journalism. Like everyone\nelse on the planet, I had been dabbling in Facebook, and I had heard\na lot about Twitter but didn’t understand how to use either very well,\nparticularly as a journalist.\nSo I charged through Sree’s programs (mostly using Google’s\nexcellent Listen app on my Android phone). The most helpful were the\nepisodes on Basic Twitter and Facebook for journalists. They\ngave some practical, but simple background on each service and shared\nadvice from other working professionals. It was enough to make me feel\ncomfortable experimenting.\nThen I went to pick up more of the episodes, which covered topics\nlike launching your own media company, using Google Docs in\nreporting and what exactly are we supposed to do with LinkedIn?\nThe audio quality wasn’t crystal clear, but the medium was simple and\nstraightforward. Before finding these, I was addicted to my RSS feeds,\nchecking each one religiously throughout the work day. I now can go\nthree or four days without even remembering to open Google Reader.\nInstead, with Twitter I have this incredible, if sometimes overwhelming,\nstream of information coming at me in (often) clever, funny snippets.\nAnd with its open, collaborative nature, it’s far more likely that I’ll\nbe turned on to new, engaging news sources and writers than I ever would\nfind by reading hundreds of individual blogs. I’ve found about a hundred\nwriters covering media issues, food, beer, film, television and soccer\nto follow on Twitter and to keep me abreast of the news and ideas of the\nday. Particularly for a news junkie, it’s a great advance.\nAs I’ve gotten more comfortable with the service, I’ve experimented with\na couple of Twitter management programs that help me more easily handle\nthe onslaught of information. Seesmic has a half-decent app for\nAndroid phones, but I’ve settled on using Hootsuite (also on Sree’s\nadvice). It’s got a great web interface that allows you to manage not\nonly Twitter, but also LinkedIn, Facebook and Myspace accounts, and its\nAndroid app is easy and attractive.\nIf you’re curious about this whole Twitter phenomenon in particular, I’d\nrecommend checking out Sree’s podcasts and then peruse his\nexhaustive Twitter guide for skeptics and newbies. If you decide to\nsign up (or if you’re already there), let me know so that I can start\nfollowing your work too.\nLeave a comment below or follow me on Twitter@ultracasualand\ntell me what tools you’ve found useful in navigating the social mediasphere.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/05/diving-headfirst-into-the-social-media-deep-end.html", 
            "title": "Diving headfirst into the social media deep&nbsp;end"
        }, 
        {
            "text": "Things have been pretty hectic over the last year. The Local News\nService is fully staffed and running at full steam. Over the summer, we\nhad a baby. Between the two, I’ve had my hands full.\nEarlier this week, I was invited to speak on a panel to address the\nfaculty at Columbia University’s Graduate School of Journalism. It\ngave me the opportunity to reflect on LNS’ first 10 months of operation\nand what I’ve learned. Here’s a draft of my scripted remarks:\n\n\nWhat’s changing, and what isn’t, in newsrooms today?\nLet me start first with a little bit of background, because I get a\nlot of questions about what the Local News Service is and how it’s\nrelated to the Star-Ledger.\nIn 2008, the Star-Ledger lost about 45 percent of its staff through a\nmassive buyout. Its parent company, Advance Publications, decided\nto set up a separate company to provide local news. This was not\nunprecedented. For years, the Ledger’s high school sports and\nobituaries have been done by an outside outfit.\nLNS was launched last year to create a new cost structure and to\nfill the local pages of the Star-Ledger and its website,\nNJ.com.\nWe have a newsroom of 15 reporters and 3 photographers covering\nmunicipal, local and breaking news in the six core counties of the\nStar-Ledger’s coverage area. Three experienced editors, including\nmyself and Rick Everett (retired Star-Ledger managing editor), offer\ndirection, context and guidance.\nWe have an additional nine or 10 staffers who produce 26 listing\ncalendars a week as well as community news items, Scouting and schools\nnews and a history column.\nOur purpose is to produce more content for print and online with\nfewer, less experienced journalists. At the same time, we want to\nmaintain the same quality and standards that readers expect of the\nstate’s biggest newspaper. And we’ve done just that. Our photographers\nand reporters produce a ton of copy. We have helped bolster the\nLedger’s zoned county sections, and on occasion, we’ve contributed\nstories to the features, business and sports sections. And while our\nprimary objective is local news, we’ve also snagged 27 front page\nstories and probably twice as many Jersey section cover pieces since\nwe went live in March.\nAlong the way, I’ve observed a few things:\nThe competition is changing. Our old enemies have become our new\nfriends as we join to fight new enemies. We now compete online with\ndozens of hyperlocal websites (Patch, Baristanet, Maplewood\nOnline, The Local, etc) as well as our old print foes from the\nGannett papers. At the same time, the Ledger has largely buried the\nhatchet with its old rival the Bergen Record, and they now share\nmost stories and have a combined statehouse bureau in Trenton.\nEverything is faster. When we get a breaking news tip, we want to get\nit confirmed and get a short version of the story online immediately,\nif not sooner. The pace is picking up.\nOur news gatherers are young. Only one of the 15 we hired was over 30.\nThis has resulted in the loss of some institutional memory. In many\ncases, the veterans who had been in the Ledger’s county bureaus for\ndecades are gone. Some are now working as spokesmen for various state\nand local agencies and private companies. But they have been replaced,\nby and large, by ambitious and energetic reporters who know little to\nnothing about New Jersey and its stories. It has been a challenge for\nus to fill those gaps while our reporters cover, in some cases, 10 or\nmore towns.\nAlthough our reporters are sophisticated Web consumers and are\ncomfortable with blogging, Facebook, shooting photos and even\nproducing videos, there is no replacement for basic reporting skills.\nThe most important thing I need from a new reporter is the ability to\nask questions and chase a story. It does me no good if you can make a\nsound slide or build a web page if you can’t find a story, ask\nquestions and get it right. I’ve also noticed that as great as it is,\nGoogle has almost grown too popular. I have a reporter who rather than\ncheck the Star-Ledger’s own, comprehensive online archives when\nlooking for old clips, she will instead just Google it and see what\nhits come up from NJ.com. She doesn’t even go to her own website to\nlook for stories.\nAll this turmoil and change has been a very tough transition for\nreaders. Our sources, particularly our favorite gadflies and midlevel\nlocal bureaucrats, have found this very confusing. They had been used\nto, in many cases, dealing with the same reporters for a decade or\nmore. They knew who to call when there was news. Now they don’t know\nwho covers what. We have gone to great lengths to get our name out\nthere. We’ve sent our reporters to as many meetings and events as we\ncan in our towns to schmooze residents and officials and explain we’re\na new operation and get our faces out there.\nAll of this is, however, exciting. We have a great time doing what we\ndo. Our reporters, because they haven’t been poisoned by the malaise\nthat afflicts many news organizations, really enjoy their jobs. We\nhave fun going into work every day and chasing the news. We get\nexcited when one of our people gets a front page story.\nIn many ways, even as business models evolve, the work we do as\njournalists every day hasn’t changed all that much. We have better\ntools to work with in some cases, and we’ve got to do more, faster,\nbut at the end of the day, it’s journalism. I couldn’t be happier.\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2010/01/the-up-and-down-sides-of-the-younger-faster-busier-newsroom.html", 
            "title": "The ups and downs of the younger, faster, busier&nbsp;newsroom"
        }, 
        {
            "text": "As with many things on this site, it’s taken me a little while to get\naround to posting this note.\nIn February, after a very successful stint at the Herald News—which\nincluded helping to lead it to win the award for best small daily in the\nstate from the New Jersey Press Association—I left to join a\nstart-up newsroom. (Alas, I also left behind my neglected soccer blog)\nNow I am one of the news editors at the New Jersey Local News Service.\nOwned by Advance Publications, we have a team of 15 reporters who\ncover municipal beats across six counties here in the Garden State.\nOn top of that, as part of my fellowship at Fairleigh Dickinson,\nI’ve been taking a course this spring on Web programming, specifically\nwith ASP.net. I’ve also been lucky enough to play a good amount of\nsoccer and DJ a couple of times with friends.\nAt a time when many newspapers are convulsing or collapsing, working for\nLNS has been a really unique opportunity to help build a news gathering\noutfit from the ground up. We provide all of our stories to the Newark\nStar-Ledger and its Web site NJ.com. So far, we’ve been having a\nblast. I have a feeling that we’re going to see more news organizations\nfollowing this model: start an outside company to focus intensely on\nlocal news and provide content for print and online. It’ll be great to\nset the precedent for how it can be done.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2009/04/moving-on.html", 
            "title": "Moving&nbsp;on"
        }, 
        {
            "text": "Dr. An,\nPlease download the .zip file here.\nThanks,\nTom", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2009/04/csci6844-homework-5.html", 
            "title": "<span class=\"caps\">CSCI6844</span> Homework&nbsp;5"
        }, 
        {
            "text": "I’ve been trying to get to this post for about a week, but the news\ncycle has been a bear lately.\nHere in Passaic County, we got hit by a major news story last week, and\nin the process of overseeing our coverage, I rediscovered a fantastic\nresource I wanted to share.\nOn Nov. 23, a gunman walked into a Syrian Orthodox Church in Clifton,\nN.J. looking for his estranged wife. Police say the man shot three\npeople in their heads before he fled, killing his wife and another\nparishioner and critically injuring his wife’s cousin.\nIt was a sad story, and our coverage on that Sunday and in the\nsubsequent days revealed a small, tight-knit community of\nChristians here that is made up predominantly of immigrants from the\nsouthern Indian state of Kerala. (Unfortunately, the relaunch of our Web\nsite this week wiped out about six other stories we wrote)\n\nPretty quickly after the shootings, parishioners who were in the church\ngave our reporters the name of the man they thought was the shooter (and\nwho was arraigned in court today). I found his phone number in\nCalifornia, and we called it. The woman who answered the phone didn’t\nspeak English, only malayalam, the language used in Kerala. I wondered\nhow I could find a translator on a Sunday evening.\nThen I remembered that for the past four years I’ve been a member of the\nSouth Asian Journalists Association or SAJA. I was ashamed I didn’t\nthink of it sooner. So I sent an e-mail to another member looking for\nhelp. Within 15 minutes, I got a phone call from someone willing to do\nsome on-the-fly translation through a conference call.\nWhen we called California again, perhaps unsurprisingly, no one\nanswered. But I was pleased by the help that SAJA was willing to offer.\nThen one of its members posted about our story on the group’s South\nAsian issues blog, SAJAforum. The comments that the forum’s readers\nleft in response to the story helped our staff members find new avenues\nof reporting in the following days. It was an indescribable boon.\nI was truly impressed with the resources SAJA had assembled and the\ncollegiality and professionalism of its members as they offered advice\nand help with our story. I was sold on renewing my membership.\nThen, a couple days later, the terrorist attacks in Mumbai happened.\nSince then, SAJA has gone into overdrive. SAJAforum has offered loads of\ntips, including daily podcasts and phonecasts. With its coverage of this\nevent, SAJAforum has proven itself an indispensable resource for anyone\nseriously covering South Asian news, both here and abroad. I can’t\nrecommend it enough.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/12/all-eyes-on-india.html", 
            "title": "When all eyes are on&nbsp;India"
        }, 
        {
            "text": "After years of hearing about it and after months of hearing friends and\nloved ones raving about it, I’ve decided to take the plunge and explore\nFacebook.\nIn years past, I had flirted with Friendster and Myspace with\nvarying degrees of interest. But Facebook seems to be the juggernaut\nthat is outpacing all its competitors. So I’ve begun to set up a profile\nand nose around it. Here’s my question for you, my small cadre of\nreaders: Once you’re signed up on Facebook, what do you do with it?\nI mean, there are only so many long-lost college classmates to track\ndown. And once we ascertain that we both exist in cyberspace and\nexchange some pleasantries, then what? What’s your favorite thing about Facebook?\nAnd once you’ve built your social network, what do you think is the best\nuse for it?\nI’d love to hear your thoughts and advice.\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/11/getting-social-networked.html", 
            "title": "Getting social&nbsp;networked"
        }, 
        {
            "text": "The nature of the news business, and the 24/7 demand of following the\nworld of futbol, keeps me more than busy much of the time. Thus, this\nlittle professional blog ends up taking a back seat until the spirit\nmoves me.\nI know it’s been awhile, and summer has already sprinted past us, but\nhere’s a quick update. Now that school’s back in session, I have one\nmore responsibility to add to my plate. This semester, I’m the North\nJersey Media Group fellow at Fairleigh Dickinson University. As part\nof the fellowship, I’m teaching an introductory course in CAR for\nstudents at the campus that straddles the lazy Hackensack River.\nThe semester has barely begun, but so far I’m enjoying working with my\ntiny class. The students seem curious and eager to learn about working\nwith Excel and databases, even if it’s not quite clear to them yet what\nto do with it all. I think this will be a good chance for me to practice\nmy classroom demeanor. And hopefully it’ll give me the impetus to make\nsome more headway on fleshing out the Best Practices section.\nWhat advice do you have for me as I strive to teach the next generation\nof journalists and writers?\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/09/back-to-school.html", 
            "title": "Back to&nbsp;school"
        }, 
        {
            "text": "Fairleigh Dickinson University - Fall semester, 2008\nSyllabus - updated 10/2/08\nThe final project - updated 10/7/08\n\nIntroduction to Excel:\nSpreadsheets for exercises:[ ][]\n\n-   [Appointments.xls][\n   ]\n-   Crony.xls\n\nExcel and math for journalists:\n\n\n-   Math for Journalists handout\n-   Citybud.xls\n-   Newsroom calculator\n\nMore Excel practice:\n\n1.  Patskuls\n2.  voterregs.xls\n3.  County overtimes\n4.  Passaic test scores\n5.  School.xls\nHomework: pursuit.xls\n\nIntermediate Excel, filtering and pivoting:\n\n\npayroll1.xls\nmoviebus.xls\nhomicide.xls\n\n\nMore pivot table practice exercises:\n\n\nskins.xls\nBaseball.xls\n\nhomework: Exxon.xls\n\nAdvanced Excel:\n\n-   payroll1.xls\n-   carphone.xls\nTipsheet: String functions and more\nHomework:Baseball.xls\n\n\nImporting data into Excel :\n\n-   Midyear pop.htm\n-   Trade.txt\n-   UNOS.html\n-   OIG.txt\n-   payroll3.txt\n- [mo00073_uf3.zip][]\n\nNegotiating for data:\n\n-   OPRA basics\n-   [How to negotiate for data ][]\n\nIntroduction to database managers:\n\n-   NEA\n\nMore Access practice\n\n-   Dams\n\nMore practice with summarizing and filtering queries\n\n-   hunting.mdb\n-   contract.mdb\n\nSQL\n\n-   MedExaminer\n-   SQL Primer\n\nRelational joins\n\n-   MDR.mdb\n\nMore relational joins\n\n-   TennCand.mdb\n-   sofla.mdb\n\n\nEven more joins\n\n-   SDR.mdb\n-   miles.xls\n\nThe dreaded enterprise join\n\n-   ildebtors.mdb\n\nMore data cleaning\n\n-   Drivers.mdb\n\nMany of the databases, spreadsheets and tips linked above were\ncreated as teaching exercises by the very fine folks at IRE. If you\nvisit the organization’s Web site, you can find a plethora of resources\nfor teaching and learning computer-assisted reporting. I am\nimmensely indebted to the work of IRE and the materials they allow me\nand other educators to use to pass on these skills.\n[\n ]: http://www.tommeagher.com/wp-content/uploads/2008/09/3appointmentsclass.xls\n    “Appointments.xls”\n  [How to negotiate for data\n ]: http://www.tommeagher.com/wp-content/uploads/2008/10/t1351.pdf\n    “Getting electronic information”", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/09/dataclass.html", 
            "title": "Data In The&nbsp;Newsroom"
        }, 
        {
            "text": "I read a lot of nonfiction, literary and otherwise, and I\nrecently finished one of the better books I’ve found on American culture\nand media in the middle of the 20th Century. “The Race Beat” not\nonly chronicles the coverage of the civil rights movement and its\neffects on American society, it offers a few good lessons on being a journalist.\nHere’s my favorite:\n\n“One other thing made Bigart memorable: he spoke with a stammer\nthat colleagues frequently saw him use to his benefit to coax\ninformation from reluctant sources.\nLelyveld, sent to Philadelphia after Bigart, met a local\nminister, introduced himself, and interviewed the minister. He came\naway with an unforgettable lesson in what it takes to be a great\nnewspaper reporter.\n“‘You’ve asked me a lot of questions,’ the minister said in a buttery\nsouthern accent after the interview was over. ‘Can I ask you one?’\n“‘Yes sir’, Lelyveld responded.\n“‘There was a man down here, an older man, said he was from The\nNew York Times. Name of Bigaht. Know ‘im?’\n“‘Yes sir.’\n“‘Couldn’t have a normal conversation with that man,’ the minister\nwent on. ‘He didn’t know anything. I had to explain\nevvvverything to him.’”\n\nNot a bad M.O. if you can pull it off. We can all learn from the old masters.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/05/he-didnt-know-anything.html", 
            "title": "He didn&#8217;t know&nbsp;anything."
        }, 
        {
            "text": "For those very few of you who have been missing my byline (hi, Mom and\nDad!), I have good news. The Herald News’ soccer writer, Ives\nGalarcep, has gone rogue and left the paper to start his own soccer\nmedia empire. Since his departure, I have been tapped to write our\npaper’s soccer blog. Last week, we launched The International\nFixture. It’s a chance for me to write about the culture and passion\nof soccer’s players and supporters. The blog will hopefully focus on the\ngame around the world and how it resonates with people in the North\nJersey and New York City area.\nSo if you’re at all interested in the beautiful game, stop by and check\nit out. It’s a hobby that I’ll try to squeeze in when my regular editing\nresponsibilities allow, but I think it will be a fun chance to write\nabout one of my favorite pasttimes. We’ll see how it goes.\nFor those who aren’t soccer aficionados, don’t despair. I’ll keep\nsharing my tips and experiences in the newspaper business here on my\npersonal site, as well.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/04/the-kick-off.html", 
            "title": "The&nbsp;kick-off"
        }, 
        {
            "text": "From time to time, you read about journalists being imprisoned in\nfar-off countries for doing their jobs. Only rarely do you recognize\ntheir names.\nYesterday, Barry Bearak of the New York Times was arrested in Zimbabwe\nand accused of  “practicing journalism without accreditation“. I\nmade Bearak’s acquaintance a few years ago when he was teaching at\nColumbia University’s journalism school. I’ve since become a fan of his\nwork. He’s a gifted and probing writer who has won the Pulitzer Prize,\nthe highest honor in American journalism.\nI heard about Bearak’s arrest this morning on the BBC. I can’t profess\nto know all the ins and outs of the situation in Zimbabwe, but I\nknow that Bearak is a journalist of integrity. I hope that Barry is safe\nand sound and released quickly.\nIt’s an outrage that any government would jail a journalist for doing\nhis job. A lot of people like to grouse about the American news media\nand accuse it of rampant bias. But situations like these only reinforce\nhow vital an unfettered press is to a true democracy.\nUpdate:Bearak was freed on bail Monday. Hopefully, his case will\nhelp shine a light on the persecution of journalists and restrictions on\nthe free flow of information in Zimbabwe. Maybe that light can help the\npeople there make a change.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/04/free-barry-bearak.html", 
            "title": "Free Barry&nbsp;Bearak"
        }, 
        {
            "text": "Before attending a job fair to interview journalism students and\naspiring reporters, be sure to update your Web site. Reporters these\ndays know how to Google.\nWhen feasible, finish updating the Best Practices section of this site.\nTake a deep breath, and enjoy spring.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/04/note-to-self.html", 
            "title": "Note to&nbsp;self"
        }, 
        {
            "text": "Some people spend years trying to learn our craft, spending thousands on\ngraduate schools. Others just go where the news is, roll up their\nsleeves and give it a shot.\nI can’t say that my friend David Lang’s method is the best way to get\ninto the business, but it’s not the craziest either. David is an\naccomplished photographer who has been learning the craft of making\npictures for some time, but this winter he went out on a limb. He flew\nto Pakistan for a month to cover the presidential elections there and to\nexplore Afghanistan.\nSo now, camera and lights in hand, David is having a hell of an\nadventure, and he’s no longer just a documentary photographer. He’s a\njournalist. His blog about his experiences in the ‘stans is\nfunny, engaging and definitely worth a read. I have a feeling we’ll all\nbe seeing much more ofhis worksoon.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/03/learning-to-be-a-journalist.html", 
            "title": "Learning to be a&nbsp;journalist"
        }, 
        {
            "text": "On Tuesday, we lost a colleague and an accomplished journalist when\nJonathan Maslow died.\nPlenty of others have already shared their memories and their\nsadness much better than I can. All I’ll say is that his humor and\nhis passion for life and the newsman’s craft will be sorely missed in\nthis newsroom. And those traits are desperately needed in so many others.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/02/maslow-mourned.html", 
            "title": "Maslow&nbsp;mourned"
        }, 
        {
            "text": "I’ve been putting off posting here for weeks, hoping inspiration would\nstrike, or I would suddenly find a bounty of free time to think of\nsomething really insightful.\nNone of this happened, so I’ll drop a few tidbits of news and links to\nsome friends, and hope I can get things rolling here again shortly.\nFirst, I’m no longer my paper’s CAR reporter. Last month, I was\npromoted to city editor. I can just hear you, in your best Maude\nLebowski tone, saying to yourself “And proud we are of you…”. Yes,\nit’s a nice new job to throw me back at the bottom of a steep learning\ncurve. Thankfully, some friends have been giving me some advice.\nSo for the time being, let me just say I promise to post again soon.\nThere’s loads of cool and exciting things happening on the Web that\nshould make journalists informed and nervous(in a good way, like\na roller-coaster ride). They should keep you busy for a bit.\nAnd let me pass on a couple of old nuggets from a former editor: get\nout of the newsroom, and use your e-mail addressbook as a way to\ncultivate sources.\nSo stop obsessing over this season of “The Wire” and step up your game,\npeople. I’m trying to.\nCheers.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2008/01/must-crawl-before-walking.html", 
            "title": "Must crawl before&nbsp;walking."
        }, 
        {
            "text": "While I use Google News fairly regularly—particularly its e-mailed\nnews alerts), I never noticed the new “comments from people in the news”\nfunction that it apparently launched last spring. It’s a fascinating\nidea that the NY Times recently took a look at (thanks, Slashdot\nfor bringing it to my attention).\nLet’s set aside for a moment the daunting challenges of trying to make\nthis work in the real world. Why shouldn’t news subjects have a chance\nto comment on a story in which they appear, particularly on the Web\nwhere the column inches are infinite? Certainly sources have already\ntaken advantage of the comment functions that many news organizations’\nWeb sites already employ. But Google has hit upon a unique twist by\nweighting the comments from those quoted in a story. The journalist has\nalready gone to the effort of vetting sources and weeding out those with\nless substantial thoughts to add to a story. To give them a chance to\ncomment after the fact and append it to the story can only add to the\ndepth of the coverage.\nIt’s conceivable that you could give every source you interview a\nspecial URL and a password. Once the story appears in the paper, they\ncould then choose to login and sound off. It would assuage the bruised\negos of those long-winded subjects who inevitably lose much of their\nargument to brevity. It would also keep reporters on their toes that\nthey could expect more than a nasty letter to the editor should they\nplay fast and loose with the facts.\nWhat do you think? Is there any reason we as journalists couldn’t (or\nshouldn’t) provide such a function on our own Web sites? Or should we\nlet Google have all the fun?", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/12/theres-always-room-for-another-two-cents.html", 
            "title": "There&#8217;s always room for another two&nbsp;cents."
        }, 
        {
            "text": "My former colleague Yoni Greenbaum has entered the journalism\nblogging arena, and he recently added his philosophy about the\nobligation of newspapers to make their corrections as easy to find\nonline as they are in the print edition.\nAs a longtime fan of Regret the Error, I couldn’t agree more. Look,\nnobody wants to make a mistake, particularly when reporters, editors and\nphotographers have spent months on an investigation. A silly bit of\ncarelessness can sully the credibility of the entire story. But what\nwould be even more damaging for the journalists involved, and\nparticularly for their newspaper, would be to soft-pedal the needed correction.\nIf you get it wrong, say so. Say it soon and say it straightforward.\nBeing forthright with readers about any errors—of omission or\notherwise—will reap dividends in the long-run.\nAs newspapers build up more vigorous online presences, it only becomes\nmore vital that they revisit their correction policies for their Web\neditions. Make it visible and be honest, and you will build even more\nloyalty for your product. A little mea culpa will go a long way.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/12/uhhh-sorry.html", 
            "title": "Uhhh,&nbsp;sorry?"
        }, 
        {
            "text": "I’ve been out of the daily reporting loop for months now as I fill in as\nan editor, but I have been involved in one cool project. One of my\nreporters is now in the Dominican Republic reporting a project on\nthe destruction caused earlier in the month by Hurricane Noel. While\nshe’s there (without a laptop, cellphone charger or camera cord—”lost”\nby the airline), I’m editing her copy and coordinating the project with\nthe Web, photo, copy and marketing staffs.\nYesterday she was in the town of Piedra Blanca, an agricultural outpost\nof about 23,000 people that was devastated by the storm. Paterson, NJ\nhas the highest population of Dominicans in the state and many of our\nreaders hail from Piedra Blanca. They led Heather to this great story.\n\n“We’re starting at zero,” said Dr. Carmen Garcia, the mayor of Piedra\nBlanca, while sitting in her sparse office on Tuesday. “This destroyed everything.”\n\nThe series will drop the next stories on Saturday and Monday with\nmore to follow next week. It will be definitely worth a read if you’re\ninterested in how new Americans return home to help their countrymen in need.\nIn the middle of juggling all the demands of launching this project\nyesterday, I did get to do a piece of data reporting. I actually managed\nto squeeze in an opportunity to run some SQL queries on a New Jersey\naccidents database for a reporter looking for some key data. She was\nlooking for the number of accidents involving school buses in Passaic\nCounty over the last five years. I was quite pleased with myself that I\ncould run the queries and find her answer in about 15 minutes. The\nnumber? 713.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/11/editing-saints-of-the-storm.html", 
            "title": "Editing &#8216;Saints of the&nbsp;Storm&#8217;"
        }, 
        {
            "text": "One of my grammatical pet peeves is the abuse of quotation marks. I see\nit often in my daily life, but as I’ve been editing lately, I’ve noticed\nit popping up more and more in the stories I coach. A lot of young\nreporters think that quoting just one word an official says lends their\nstory some kind of credibility. What they fail to realize is that the\ntechnique has the opposite effect. It either confuses the reader or\nsuggests that the writer intends to use the quote sarcastically.\nSo I was thrilled this morning when I discovered (through the help of\nthe ever-resourceful Depth Reporting) the “Blog” of “unnecessary”\nquotation marks. Hopefully this will help me make my argument that\nit’s often better to avoid the gratuitous quotation marks as if they\nwere “air quotes”. Enjoy.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/10/hilarious-no-sarcasm-intended.html", 
            "title": "<span class=\"dquo\">&#8220;</span>Hilarious&#8221;, no sarcasm&nbsp;intended"
        }, 
        {
            "text": "There’s been a lot of hand-wringing in recent years about the bleak\nfuture of journalism in general and of newspapers in particular.\nThere are two skills that I believe are now indispensable in the field.\nAny journalist who won’t begin to embrace them is simply not ready for\nthe future of the business. What are they? Computer-assisted reporting\nand Spanish (or any other second language, for that matter).\nVery few news organizations or journalism programs have invested\nresources into teaching their journalists these skills. How are you\nsupposed to learn them, then? DIY!\nNot everyone has the time or money to attend one of IRE’s excellent\ntraining sessions. Thankfully people like my colleague Christopher\nSchnaars at The Record have pulled together some resources for you\nto learn on your own (stage whisper: thanks to Depth Reporting for\npointing this out). Schnaars has a great, four-part course on\nlearning to use the Microsoft Excel spreadsheet program. This is not\nC++ GUI programming. These are basic skills that every reporter in\nthe newsroom can and should master. Do yourself a favor and work through\nSchnaar’s lessons. You’ll find them endlessly helpful in your reporting\nand editing. If you want to keep going after that, then the Reporter’s\nCookbook will point you to the help you need.\nPersonally, I’ve got the CAR skills, and now I’m turning my attention to\nlearning a new language. Thank you, Clifton High School’s adult\neducation night classes. You should look at night schools and\ncommunity colleges in your area for similarly-affordable options. I’m\nabout a third of the way through an elementary Spanish class. To gauge\nmy progress, you can see this short exchange I wrote myself:\n\n“¿Como esta?”\n “No rapido, pero de acuerda.”\n\nIf my very, very rudimentary Spanish is off the mark, which it likely\nis, allow me to translate.\n\n“How is it?” (meaning my progress in learning Spanish)\n “Not fast, but OK.”\n\nYou’ve got to learn to walk before you can run. Good luck.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/10/two-skills-for-the-future.html", 
            "title": "Two skills for the&nbsp;future"
        }, 
        {
            "text": "From the shameless self-promotion department, here’s a couple of nice\nstories we ran this weekend that I had a hand in.\nFor the past couple of months, I’ve been editing full-time, so I haven’t\nhad a lot of bylines of late. But my latest project, which I put\ntogether in conjunction with our intrepid cops reporter, looks at the\nworst intersections in our county for pedestrians.\nIt all started when I found that the New Jersey Department of\nTransportation posts all of its crash records—the databases listing\nevery accident in the state in which a report was filed—online. We took\na look at the last six years to see what intersections have proved most\ndangerous, and deadly, for walkers and cyclists. Once I got the data,\nthe hardest part was figuring out how to standardize the names of the\nintersections. One accident might be listed at Main and Market streets.\nThe next accident would be listed at Market and Main streets, but\nthey’re really the same interesction. With a little help from the\neverready NICAR listserv, I leapt over that hurdle and kept running.\nWe used the state DOT’s formula for weighting the severity of each\naccident. Those with more serious injuries got a higher score. Those\nwith a complaint of pain or simply property damage got a very low score.\nThen we just added up the scores for every accident at each\nintersection. Pretty straightforward, although it took us some time to\npull it all together.\nThe product, a nice explainer piece for our readers, ran Sunday. Judging\nby the early chatter on the local message boards, forums and blogs, it\nseemed to get a good response from readers. It was accompanied by a\ncoolsound slides that we put together with the help of our photo\nstaff. Of course, there was also the de rigeurGoogle map showing the\nclusters of the worst intersections and highlighting the 12 where\npedestrians have been killed by drivers since 2001.\n\nThen, this morning, we ran a project that I had coached and edited from\nthe beginning on the dogfighting underworld in New Jersey. Despite\nthe headlines generated by Michael Vick’s arrest and downfall over the\nsummer, very few outlets really took the time to understand the allure\nof dogfighting and related blood sports like cockfighting.\nReporter Heather Haddon spent weeks cultivating sources to do just that,\nto get into the dogfighting landscape that is surprisingly popular here\nand to explain why thousands of people are attracted to it. I think she\ndid a great job. I hope you agree.\nLet me know what you think of these projects. Any reactions? Criticisms? Advice?", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/10/my-dog-is-better-than-yours.html", 
            "title": "<span class=\"dquo\">&#8220;</span>My dog is better than&nbsp;yours&#8221;"
        }, 
        {
            "text": "A friend just alerted me to Kirix Strata, a Web browser that will\nlet you work with raw data as you see it on your favorite Web pages. You\ncan easily manipulate html tables or create mash-ups with RSS feeds.\nThis is an intriguing idea. I wonder if, like Swivel (another\nnew-fangled Internet contraption I haven’t had the time to really\nexplore yet), this will help democratize data analysis.\n(Of course, Depth Reporting had this tidbit more than a month ago,\nbut I must have missed that post the first time around.)\nThese discoveries led me to a few questions:\n\nHave any of you had a chance to use either Kirix Strata or Swivel?\nWhat have you been able to do with these tools and would you\n    recommend them for a harried journalist working with data?\nWhat pointers can you share to help a newbie get the most out of\n    these applications?\n\nI’d love to hear any feedback you have. Post a comment and let me know\nwhat you think.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/09/a-browser-for-data.html", 
            "title": "A browser for&nbsp;data?"
        }, 
        {
            "text": "Although you probably wouldn’t know it from the miniscule bit of\ncoverage it has received thus far, the Women’s World Cup (of soccer) is\ncurrently underway in China. Since I don’t have cable at home, and the\ngames have been broadcast in the middle of the night, I’m sad to say I\nhaven’t seen any of the play beyond the usual highlight clips on YouTube.\nBut I have been very interested in the small bit of very good writing\nabout the tournament that has made its way back here. Steve Goff of the\nWashington Post made the trip to China to follow the U.S. Women’s\nNational Team’s exploits there, in the process offering a window into\nthe East that we rarely get.\nThe stories that have captured my attention the most thus far are those\nthat show the inequities that exist in world football. Even though few\npeople really support the Americans here, they are the best team on the\nplanet (rivaled perhaps only by Germany and, now, Brazil). Other\nnations treat their women’s teams the same way Americans treat all\nprofessional soccer—like a second-class sport fit only for the Third World.\nProbably the best story I’ve seen on the growing pains of women’s\nfootball around the globe illustrates that better than most. It came in\nthis excellent Al-Jazeera English piece on the slow rise of women’s\nsoccer in Egypt (thanks to the\nlate-to-the-game-but-increasingly-greatGoal blogby the NY Times for\nthe clip). Perhaps it’s unsurprising that no teams from the Middle East\nmade it to China for this year’s tournament.\nSo the U.S. Women will face off against the Brazilian Samba Queens\nThursday in the Cup’s semi-finals. A win against Brazil (nearly\nunthinkable for the men’s squad), and the team will book a slot in the\nfinals, likely against its nemesis Germany. I think there’s really no\ndownside to the expanding popularity, and skill, of the women’s game.\nBut as Steve Goff reported today the glass ceiling isn’t just an\nobstacle for women in corporate America. The winners of the Women’s\nWorld Cup will receive a mere fraction of the prize money that the\nItalian men took home last summer.\nAs entertaining as the games in China may be, we’ve still got a long way\nto go.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/09/insert-bad-cyndi-lauper-pun-here.html", 
            "title": "Insert bad Cyndi Lauper pun&nbsp;here"
        }, 
        {
            "text": "I once heard an editor compare working in New Jersey to hunting in a\ngame preserve. Much like their cousins in South Florida, Jersey\npoliticians never cease to provide a wealth of good stories.\nA week or so ago, we got one of those stories when federal investigators\nlaunched the latest in their regular series of corruption arrests of politicians.\nOf the dozen or so public officials arrested statewide on charges of\naccepting bribes, four come from our coverage area in Passaic County.\nEach was accused of taking thousands of dollars—one was to allegedly\nhave his bribe wired to an account in the Dominican Republic after being\nlaundered in Switzerland—in exchange for arranging municipal insurance\nand roofing contracts.\nSince our City Editor departed for the snowy vistas of Minnesota last\nmonth, I’ve been filling in as an assistant editor on the desk. As this\nstory broke about 9 a.m. on a Thursday, I got to really sink my teeth\ninto managing this story. We deployed 11 of our 13 city desk reporters\nto cover the news. Then we wrangled another three reporters from the\nfeatures desk to lend a hand.\nWe put out a barrage of stories in Friday’s paper: from the reaction of\nthe constituents to the immediate political wrangling that\nerupted over the pending election for the seat of the\nAssemblyman/Undersheriff/Clergyman who\nwas arrested. We also had a nice profile of the former professional\nwrestler and cop-turned-mayor who got caught in the sting. Our lead\npiece used some of the text from the federal complaints and wiretaps to\nanalyze the differing leadership styles of the two arrested\nheavyweights from our area.\nAnd then at 3 p.m. on the same day, they shut down the entire school\nsystem in the city of Paterson for fire code violations. So we had\nto scramble two more reporters to handle that story.\nIt was a great rush to work on a big breaking story from the other side\nof the assigning desk, moving reporters and resources around to handle\nthe emerging threads of the news. I got to chip in by doing some\nbackgrounding of some of the arrested pols, but I didn’t get to be as\nhands-on as I normally would. Thankfully, there will surely be more\nstories like this coming down the road.\nAnd three days later, while working a weekend shift as a humble\nreporter, I finally got my shot to write a piece of the story.\nSo it goes.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/09/lets-get-this-thing-rolling.html", 
            "title": "<span class=\"dquo\">&#8220;</span>Let&#8217;s get this thing&nbsp;rolling.&#8221;"
        }, 
        {
            "text": "In this era of spam and astroturf, not all readers of the blog\nare the same. I had a new user visit and register recently, but\napparently I’m not the only site he visited.\nI guess I should be flattered, but no readers are sometimes better than\na flood of spam.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/09/unwelcome-visitors.html", 
            "title": "Unwelcome&nbsp;visitors"
        }, 
        {
            "text": "For weeks, I’ve been planning this post, my paean to Jack Kerouac and\nthe influence he had (along with the likes of Ernest Hemingway, Jack\nLondon, George Orwell and J.D. Salinger) on my early life as a writer.\nBut the hustle and bustle of daily journalism has once again thwarted my\nbest intentions.\n50 years ago today, Kerouac’s “On the Road” was published. Reading\nit as a teenager—if only I could remember who had first handed me a\ncopy—led me on an odyssey of discovering and devouring the subversive,\nonomatopoetic oevre of the Beat Generation and its writers. Since\nthen, many others have surmounted Kerouac’s primacy in my pantheon of\nliterary gods, but I still hold a soft spot for him (and the dozens of\neditions of his books I still hoard).\n\n\nMy desire to mimic Kerouac, and his brief stint as a sports reporter,\nled me to explore journalism as a career.\nThen, my high school English teacher, with his heavy Southern accent and\naffinity for heavy suede workboots, spied me reading “On the Road”\nbefore class (it was not on the syllabus).\n“Y’know,” he said, “Ol’ Jack drank hi’self to death back in ‘69.”\nThat teacher turned me on to H.L. Mencken and taught me to write a news story.\nA couple weeks ago, I rode my bicycle through Brooklyn and Queens to\nvisit Kerouac’s former apartment in Ozone Park. Over what is now a\nflower shop (“Little Shoppe of Flowers”…hilarious), he lived with his\nparents and wrote “The Town and the City”. I believe it was also the\napartment where his father died of stomach cancer, exacerbated by his\ndrinking. On a busy morning, I rode through traffic on Crossbay\nBoulevard to visit the site. A man washed his ambulance on the street\noutside. He looked at me like I was crazy for taking a picture of the\nbuilding and the small plaque next to the door:\n\nSo now, let me join the chorus of writers who have come to\npraise Kerouac and to bury him. Maybe it’s time I picked up “Vanity\nof Duluoz” or “Maggie Cassidy” one more time. It’s funny, the\nplaces these circuitous trails lead you.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/09/hey-jack.html", 
            "title": "Hey,&nbsp;Jack"
        }, 
        {
            "text": "[youtube]http://www.youtube.com/watch?v=lj3iNxZ8Dww[/youtube]\nHere’s one good reason why “U.S. Americans” need more good maps in\ntheir newspapers and online.\n(Courtesy of Boing Boing)", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/miss-teen-south-carolina-hearts-maps.html", 
            "title": "Miss Teen <span class=\"caps\">S.C.</span>*hearts*&nbsp;maps"
        }, 
        {
            "text": "It seems the Internet has done as much for amateur cartographers as it\nhas for budding pornographers.\nAs I promised earlier, I have a few resources to share on mapping,\nparticularly of the Google Maps variety. I had actually been planning on\nposting this for the last few days, when I noticed this mention the\nAnalytic Journalism blog of Google’s new feature that allows users to\nembed a personal Google Map into a Web blog using just a tiny snippet of\nHTML. This is a feature that’s long overdue, and should make all of the\nhub-bub over map mash-ups all the more accessible for the average user.\nI almost wish they had offered such a feature last year when I made my\nfirst Google Map. I was writing an investigative project about the\ncity of Paterson selling off its property tax liens against vacant lots\nto a third-party investor. I decided to take the database I had already\nbuilt, and with a little help from Excel, I was able to add the lines of\ncode that let me dump it into a map using the Google Maps API.\nWithout ever having worked with an API in my life—just a little bit of\nrudimentary HTML—I was able to learn the code and whip up the map in\nthe span of a couple days. Most of that time was spent on the hardest\npart: driving around town with a laptop on my passenger’s seat and a\nphotographer in the back taking pictures of each of the 160+ properties\non the map. I thought it came out great.\nAdding a Google Map to your story (or a Yahoo Map for that matter) is\nconsiderably easier than working with ArcGIS to produce the static maps\nyou often see in the paper. And its a great Web feature that readers\nseem to dig. If you want to learn how to start tinkering with the API,\nhere’s a few good starter pages:\n\nGoogle Maps API tutorial\nMapki: a Google Maps wiki\nThe Google Maps Mania blog\nA Google Maps geocoder (which you need to determine the\n    longitude and latitude points for the addresses you want to plot on\n    a map.\nThe Donkey Magic mapmaker will help you create your map using\n    next to no code. It writes the backend source code and you just cut\n    and paste.\n\nAlso, here’s a few other of my favorite recent mapping toys:\n\nThe Gmap Pedometer helps you find routes (and distances between\n    destinations) as the crow walks, block by block. This is great for\n    living in New York City. I use it to plot out [my weekly bike\n    rides][] across the Outer Boroughs.\nFinally, BatchGeocode.com is a great resource that I seem to use\n    again and again for mapping projects large and small. If you have a\n    lot of points (more than a few hundred), it can take some time, but\n    it’s free and it’s easy, like all good maps (and graphics in\n    general) should be.\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/maps-maps-maps.html", 
            "title": "Maps, maps,&nbsp;maps"
        }, 
        {
            "text": "As the newspaper industry struggles to ensure its relevance in the\nchanging media landscape, there are a few pioneers out there who have\nthe right idea. One of them, Adrian Holovaty, created the innovative\nChicagoCrime.org by databasing freely-available crime reports from\nthe Web and mashing them up with Google Maps (more to come on mapping later…).\nNow another innovator, the St. Pete Times’ Matt Waite has done\nsomething similar to measure the truthiness of next year’s crop of\npresidential hopefuls. Politifact is a Web site built on a growing\ndatabase of political rhetoric, checked out with old-fashioned\nreporting. It’s not only interesting and entertaining to see which\ncandidates’ pants are on fire, but it proves that today’s\njournalists will have a great future as newspapers evolve out of their\ncurrent doldrums—if those intrepid aces can think about what readers’\nwant and what they can actually use. I think Matt sums it up nicely:\n\n“All the talk and all the focus lately in web journalism circles is on\nlocal, local, local and to some degree they’re right. But there’s also\nsomething to be said for just putting a good idea on the web that\npeople might find useful.”\n", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/the-truth-in-numbers.html", 
            "title": "The truth in&nbsp;numbers"
        }, 
        {
            "text": "In our rush to embrace the Web, it’s interesting to keep in mind some of\nthe limitations the medium could impose on journalists.\nCNet News.com posted a story looking at how some of history’s best\nheadlines might not hack it in the digital age. Here’s what they\nwrite about one of my favorites…\n\n“Ford to city: Drop dead” — New York Daily News reporting\nPresident Ford’s denial of a federal bailout (1975)\n[Internet search expert]: Would suggest “President Ford” over “Ford”,\nand “New York City” over “City”.\n\nThanks to Business Week’s Blogspotting for pointing this out.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/web-to-heds-no-more.html", 
            "title": "Web to heds: &#8220;No&nbsp;more&#8221;"
        }, 
        {
            "text": "One of the benefits of having no readers is that no one will be\nimpatiently demanding that I have all my ducks in a row while I continue\nto get the new site up and running. I’d say I’m about 80 percent of the\nway there. I have a few design features I need to tweak (anybody notice\nthat the word HOME disappears when you roll over it on the navigation\nbar? Any suggestions?), and some more background content to add before\nI’m completely happy with this site going forward. Once the backend is\nset, my hope is to post on here about once or twice a week.\nThat said, right now you can check out the Best Practices section.\nToday, I added about a dozen short write-ups I’ve collected over the\nyears. That part of the site is intended as a repository of tips,\ntechniques and guidelines for tasks many reporters are faced with. From\nhow to cover a municipal beat, to how to cover a weather story, to some\nbasic statistical analysis. A few of the beginner Best Practices are up\nright now. Over the next few weeks, I’ll put up the rest of my archives. Enjoy.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/a-little-reading-while-i-clear-my-throat.html", 
            "title": "A little reading while I clear my&nbsp;throat"
        }, 
        {
            "text": "", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/archives.html", 
            "title": "Archives"
        }, 
        {
            "text": "Please bear with me over the next few days. I’m in the process of moving\nthis site from a free host to my own server. Thus, there will be a lot\nof kinks to work out. But if you stop by, please leave a comment and say\nhello, and let me know what kind of tips or posts you’d find helpful.\nThanks,\nTom", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/growing-pains.html", 
            "title": "Growing&nbsp;pains"
        }, 
        {
            "text": "Amidst the shock and tragedy of last week’s bridge collapse in\nMinneapolis, journalists around the country embraced the power of\ncomputer-assisted reporting to enhance their reporting. One such\nreporter compiled a cool list of many of the great stories they\nproduced.\nSome of the praise for this response is owed to IRE and its database\nlibrary. Many in the industry knew immediately that IRE keeps a copy\nof the national bridge inspection inventory database created by the\nU.S. Department of Transportation. Hundreds flooded IRE with requests\nfor the database. I was one of them. With little time, my colleagues\nand I managed to pull together a story telling readers about the\ntroubled bridges in our area. My only regret was that we did not\nhave the time to throw our own local “structurally deficient” bridges\ninto a map for our readers.\nWithout IRE’s help, though, we likely would not have had a story at all.\nIf you’re not already familiar with their tipsheets and databases and\nhelp, then acquaint yourself quickly. So the next time news of public\nsafety breaks, you’ll be ready.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/the-data-behind-a-disaster.html", 
            "title": "The data behind a&nbsp;disaster"
        }, 
        {
            "text": "From my old Web site’s bio:\nThere are times when I wonder what I’ve gotten into by becoming a journalist.\nWhen I spent 11 hours a day working as a laborer for a story only to\ngo to my temporary home with its shabby little bed in a rooming house, I\npondered whether my reporting would make a difference.\nOn another story, I trudged bootless through knee-deep flood waters in a\nramshackle and neglected neighborhood along the Passaic River in\nPaterson, New Jersey. I thought that people might not be able to\ncomprehend the suffering of the poor that natural disasters could only compound.\nAnd when, on assignment, I choked on pepper spray as I stood among\nprotesters being arrested, taking notes at a presidential inauguration,\nI worried that I wouldn’t be able to breathe again.\nBut each of these times, and every day before and since, I reminded\nmyself that if I do not write these stories, no one else will. My job is\nto shine a light on the lives of working Americans. Without these\nstories, our understanding of modern life is not only incomplete, it’s inaccurate.\nThe quest to tell these stories began for me at 18, when I moved from my\nhometown of Baltimore to the Midwest. I began to dive into the lives of\nthe working-class and the forgotten Americans that I would later\nchronicle in my work. Even while I studied at, and\neventually was graduated from, the world’s first journalism school at\nthe University of Missouri, I longed to write their stories.\nSince then, I have worked for several newspapers and a wire service. But\nI also worked in a hodgepodge of fields that have reminded me of the\ngreater world, a world outside the halls of government and police\nstations where we as journalists often find ourselves stuck. I have been\na welder, a construction laborer, a deli worker, a short-order cook, a\nDJ, a dishwasher, a record store clerk, a grocery store bagger and a closed-captioner.\nAlong the way, I moved to New York City where I completed my Master’s\ndegree at the Graduate School of Journalism at Columbia University.\nToday, I live in Brooklyn with my wife, her very fat cat and our very\nold dog. I am the research reporter—responsible for computer-assisted\nreporting and freedom of information requests—for the daily Herald\nNews, about 20 miles away in New Jersey. My job allows me to pursue\nthe kind of journalism I’ve always wanted to do. I get to write\nstories—about corruption, about poverty, about working, about floods\nand protests—that people need to read. I get to write stories that show\nour readers a world they never knew existed or, worse yet, never understood.\nIn what little free time I have, I am also researching a book that I\nbegan while a student in Samuel Freedman’s renowned book-writing\nseminar.\nI’m very glad you stumbled upon this Web site. I hope you’re looking for\nthe kind of stories that I like to write, stories about people who never\nget recognized. Now you’ll know to watch for my byline. You’ll be\nreading a lot more of my work.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/idealistic-muckraker.html", 
            "title": "Idealistic&nbsp;muckraker"
        }, 
        {
            "text": "I can think of no better way to launch this new experiment in blogging\nthan to sadly note the passing of an icon of American journalism. As it\nwas reported earlier this week, the venerable Weekly World News\nwill soon go dark. This fine purveyor of insane fictional columnists and\nalien abductions has entertained shoppers at grocery stores nationwide\nfor decades. The progenitor of The Onion, The Colbert Report and\nFox News, it developed a devoted cult following. It died at 28.\nOn that note, I’ll briefly introduce this site. I hope it will serve as\na platform for me to share some of my experiences and work as a\nnewspaper journalist in computer-assisted and investigative\nreporting. I also plan to share techniques and Web resources that I\nfind useful in my daily reporting. It will pay for you to keep an eye on\nthe “Cool Resources” and “Reporting & CAR” feeds on the right column.\nIn my spare moments, I hope to be able to comment on one of my other\npassions: soccer. Let’s see where this all leads us. Thanks for\ntuning in.\nCheers.", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/2007/08/brooklyn-reporter-eaten-by-vampires.html", 
            "title": "Brooklyn reporter eaten by&nbsp;vampires!"
        }, 
        {
            "text": "", 
            "tags": "Uncategorized", 
            "loc": "http://tommeagher.github.io/blog/1999/10/test.html", 
            "title": "test"
        }
    ]
}